[
  {
    "id": 1845068814326641014,
    "content": "#blossoms Beautiful blooming sunflowers at Shanghai Blooming Garden! : Shanghai Blooming Garden #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1695458076684632127,
    "content": "#blooms Explore the enchanting Water Lily World Exhibition at the 2023 Chenshan Botanical Garden! It runs until just September 24th, so don't miss it! Address: No. 3888, Chenhua Road, Songjiang District #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1866395655717130680,
    "content": "#tourguide Ready for an unforgettable winter getaway? Experience breathtaking landscapes and delicious cuisine on this 2-day adventure! #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1909803455171961273,
    "content": "The 240-hour transit visa-free policy is a game-changer! Learn if you qualify and how to maximize your 10 days exploring multiple Chinese cities. : China Daily #meetinshanghai #AllInShanghai #Shanghai #ChinaTravel #VisaFree #ExploreTheWorld #TravelNews #240HourVisaFree"
  },
  {
    "id": 1865410945897689291,
    "content": "#attractions The Yu Garden Display has transformed into a stunning spectacle with new decorations that look like butterflies taking flight among the flowers. Don’t miss out on this beauty—head over and see for yourself! : Rionida #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1638851330726051840,
    "content": "#tourguide Shanghai Spring Park Guide: Integrating natural fir waters, geological science, forests, and leisure, the park is suitable for outdoor sports lovers and families alike looking to barbecue, camp, or simply go for a lovely stroll! Dongping National Forest Park"
  },
  {
    "id": 1624655037401104387,
    "content": "#Photography Jing'an Temple : WillU #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1720098941587657209,
    "content": "#tourguide Get ready for the grand opening of Shanghai Disneyland's 'Zootopia' theme park on December 20th! Join the excitement! #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1808818045424369731,
    "content": "#food Indulge in a full of a bowl of seafood noodles of super generous portions with must-try crab roe delicacies and signature pure crab roe soup dumplings at the Liyuan Road Main Store of Jiajia Tang Bao. (Address: No. 62 Liyuan Road) : Fangdachuan #meetinshanghai #Shanghai"
  },
  {
    "id": 1855988862918488086,
    "content": "#Exhibition Art lovers, rejoice! A vibrant new wave of exhibitions has swept through the charming old villas of Shanghai, revealing the enchanting aesthetics of Shanghai style. Dongliang Craft Atelier WYSH Feiyueli Time: Now until November 15 Address: 188 Wuyilu, Changning District Designing Jewels L'ÉCOLE, School of Jewelry Arts Time: November 1, 2023 - March 30, 2025 Address: 796 Huaihai Middle Road, Huangpu District, Richemont Twins Villa #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1808365052828782626,
    "content": "#Exhibition Dive into the art scene with the latest exciting exhibitions across Shanghai. On Top of the Pyramid: The Civilization of Ancient Egypt Emerging Curators Project 2024 Cao Fei: Tidal Flux #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1808742542344593859,
    "content": "#hotspot Enjoy the mesmerizing water curtain show at Panlong Tiandi and unwind with a relaxing boat rowing experience at night. : Erika #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1883349305903493173,
    "content": "#chinesenewyear As the Spring Festival gets closer, Shanghai TianZiFang is bursting with vibrant festivities! Known for its unique alleyway charm, this cultural hotspot has become a melting pot of experiences thanks to the influx of both domestic and international tourists. Come see for yourself! #meetinshanghai #AllInShanghai #Shanghai #springfestival #chinesenewyear2025 #CNY"
  },
  {
    "id": 1679869862372593664,
    "content": "#tourguide Take a delightful stroll down Dongping Road! : Youoyoumijing #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1894039583160995984,
    "content": "Big news from Shanghai! The results of the 2024 \"International Communication of Chinese Culture\" project and the highly esteemed \"Silver Dove Award\" have just been unveiled. The city's cultural initiatives shine bright, earning 26 awards! Projects like the \"Shanghai Symphony Orchestra's 145th Anniversary\" and the \"Shanghai Tourism Festival Opening Grand Parade\" were among the highlights celebrated for their excellence. Bravo, Shanghai—a true cultural powerhouse! #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1698257522774401278,
    "content": "#Photography See the beauty of a Shanghai sunset with the Shanghai Sunset Train! : Baigedesheyingshenghuo #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1696024243098771583,
    "content": "Paris Moderne 1915-1945: Time: From now until October 20th Address: Shanghai Power Station of Art (678 Miaojiang Road, Huangpu District) #meetinshanghai #Exhibition #AllInShanghai #Shanghai"
  },
  {
    "id": 1703073667381641406,
    "content": "#festival Shanghai Tourism Festival’s thousand drone show lights up the city! #meetinshanghai #AllInShanghai #Shanghai #ShanghaiTourismFestival"
  },
  {
    "id": 1808410356181557601,
    "content": "#attractions Witness the enchanting Bund lights from the sunken riverside viewing corridor behind Museum Of Art Pudong. : monkiki #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1802461146902868135,
    "content": "#hotspot More than just a shopping hotspot, Panlong Tiandi in Qingpu is a picturesque Jiangnan style paradise! From majestic dragon boats to poetic opera stages, immerse yourself in the charm of Jiangnan!"
  },
  {
    "id": 1877233846049005880,
    "content": "#tourguide Experience the breathtaking beauty of Guilin Park, where nature itself is an artist! This picturesque spot features simple yet elegant wooden tea tables, intricate wood carvings, and stunning twisted branches of vibrant maple trees, all ablaze in shades of red, orange, and gold. It’s like stepping into a living painting! : Rionida #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1835332750213013919,
    "content": "Fall into Shanghai's September Splendor! Unveil the mesmerizing greenhouse garden at Shanghai World Expo Cultural Park, featuring distinct thematic venues re-creating varying natural scenes and climates. Adult tickets: 98 CNY Weekend/Holiday tickets: 128 CNY"
  },
  {
    "id": 1815733602618871895,
    "content": "#cultural Marvel at the magnificent Shanghai Iron Flower Show for a dazzling experience like no other! : mandaidai #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1697532861409362350,
    "content": "Indulge in a unique combination of art and food at Crab&Painting! Here, famous Chinese paintings like \"Dwelling in the Fuchun Mountains,\" \"A Thousand Miles of Rivers and Mountains,\" and \"Han Xizai's Evening Banquet\" are presented as beautifully crafted delicacies."
  },
  {
    "id": 1839817404215636111,
    "content": "#festival Embrace the allure of traditional Chinese charm at the 2024 North Bund Landscape Life Festival. Time: September 27-28, October 1-7, 18-20 Location: The North Bund International Passenger Center #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1701559690810003908,
    "content": "#newsChina's first urban alpaca ranch attracts visitors with magic healing power. #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1673240177404432388,
    "content": "#blooms Travel to Guyi Garden through the lens of Hu Rongshan! : Shanghai Guyi Garden #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1753069694242926902,
    "content": "#attractions Shanghai Disney's Year of the Dragon New Year celebration has kicked off! Explore new Spring Festival outfits and experience a lively and joyful New Year catwalk with your favorite characters! : Shanghai Disney #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1834275787383451731,
    "content": "Step into a world of wonder as the China Art #Museum (Shanghai Art Museum), Cheng Shifa Art Museum, and other leading art institutions open their doors for nighttime exploration. Immerse yourself in the magic of art as you discover the city's creative soul!"
  },
  {
    "id": 1834094589285667084,
    "content": "Indulge in the diverse flavors of local delicacies all in one spot this Mid-Autumn Festival at Jinjiang Amusement Park! The 2024 Jiangnan Food Festival is back on September 14th, offering over 20 stalls showcasing a culinary journey through Lishui, Suzhou, Wuhu, and more."
  },
  {
    "id": 1670450545876959237,
    "content": "#tourguide If you want to experience the historical charm of the Jiangnan region, you might consider visiting Qingxi Old Street for a leisurely exploration. : Shangwei #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1692090383168417797,
    "content": "#cute Celebrate Jiajia's birthday at Shanghai Wild Animal Park! Join the festivities and make unforgettable memories with the adorable giant panda. : Shanghai Wild Animal Park #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1675161084515450882,
    "content": "Make sure you bring your appetite and a discerning palate to this dining experience immersed in history and charm! Come to Yongxing Restaurant, the Michelin-starred destination tucked away in a charming Shanghai alley! : No. 1, Lane 626, Fuxing Middle Road : ConnieWang"
  },
  {
    "id": 1671374874600935424,
    "content": "#MISA The 2023 Music in the Summer Air is back! Buy your tickets now and experience a world of music from classical to jazz to pop! MISA official website: #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1701745932168253756,
    "content": "#festival The 22nd China Shanghai International Arts Festival Exhibition (Expo) Project is here to captivate art enthusiasts from all over the world! #meetinshanghai #AllInShanghai #Shanghai #ChinaShanghaiInternationalArtsFestival #CSIAF #ArtFestival #Festival #Art"
  },
  {
    "id": 1834909968535097707,
    "content": "#MidAutumnFestival #mooncake Immerse yourself in the spirit of Mid-Autumn Festival with the exclusive collaboration between Daoxiang Village and the smash-hit game, \"Black Myth: Wukong\"! Address: Shanghai Jiuguang Center, No. 2188 Gonghexin Road, Jing'an District"
  },
  {
    "id": 1738036888328695980,
    "content": "#tourguide Experience the enchanting \"Maillard\" scenery in Shanghai's suburbs, embracing the history and charm of Jiangnan cultural heritage. #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1686221480231841792,
    "content": "My Favorite #Shanghai EP41 In this episode, witness the beautiful sounds coming from Yang Peixuan’s piano. This student from Beijing shares her unique perspective on Shanghai and how, through music, she discovered the essence of the city and made meaningful connections."
  },
  {
    "id": 1701558227564208379,
    "content": "#news Jiading offers bursts of color to celebrate summer. #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1755603892631425350,
    "content": "#chinesenewyear See just how popular and alluring the Yuyuan Lantern Festival is in this video! : Xiyuankeke #meetinshanghai #AllInShanghai #springfestival #chinesenewyear2024 #CNY"
  },
  {
    "id": 1832388349732028888,
    "content": "#Photography Tranquil birdwatching in the lush Gongqing Forest Park : Xiaoweiwangweixiaodanshiaisheying #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1758289337937166760,
    "content": "#chinesenewyear Immerse yourself in captivating Spring Festival Museum experiences at these renowned venues (Huangpu): Shanghai Power Station of Art Shanghai Jiushi Art Museum MoCA Shanghai Shanghai Johhan Art Museum Shanghai Chun Art Museum Bund One Art Museum"
  },
  {
    "id": 1744741316410618264,
    "content": "#food Indulge in Shanghainese delights like these Fried Rice Cakes with Shredded Pork : Sheichilewodenailao #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1764136113562620317,
    "content": "#hotspot Witness the sublime beauty of the Iron Flower at Shanghai Haichang Ocean Park, an enchanting light and spark show that captures the park's allure! : Rebecca #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1685127254135697409,
    "content": "#DiscoverShanghai Cool off in style! The historic Hongkou Swimming Pool is open until August 27th at No. 500, Dongjiangwan Road, Hongkou District. Get your swim on and beat the heat this summer! Address: No. 500, Dongjiangwan Road, Hongkou District #meetinshanghai"
  },
  {
    "id": 1866395748763570501,
    "content": "DAY 1: Kick off your adventure at Xisha Pearl Lake Scenic Area with the captivating \"Forest in the Water.\" Enjoy a delicious meal at the Pearl Lake Floating Restaurant, famous for its organic fish feast. After lunch, take a scenic bus tour and witness a wild goose release. For dinner, indulge in farmhouse cuisine at Juxiang Garden, then relax at the charming Daoxiang Huashe homestay nestled in Dao 1968."
  },
  {
    "id": 1689905166991122432,
    "content": "#tourguide Get ready for the Shanghai Jinshan Beach Music Festival from August 5th to August 13th! Don't miss out on this exciting music extravaganza and unforgettable beach party! : Zhangyumei #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1830168971733319756,
    "content": "#hotspot Beat the heat in style and dive into an aquatic fun at the Shanghai Ocean Aquarium! Behold majestic sharks, graceful turtles, and a vibrant array of marine life, as you immerse yourself in a sensational underwater adventure right in the heart of the city. : Haze"
  },
  {
    "id": 1835604537983300033,
    "content": "Mesmerizing moon rising over Lujiazui in Nanxiang! : Mr.Bee #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1746541931247603733,
    "content": "#coffees Don’t miss Can Company’s delicious new coffee lineup Address: No. 272, Ruijin 2nd Road, Huangpu District : aaallou #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1764223690873679962,
    "content": "#sports Discover Extreme PLAY's World of Thrills and Excitement! Embark on an exhilarating adventure at Extreme PLAY, featuring an array of heart-pounding activities and entertainment, making for an unforgettable experience! : Zhourizhourizhouri #meetinshanghai #Shanghai"
  },
  {
    "id": 1759021663247536556,
    "content": "#Exhibition Discover the \"Encountering the Marquis of Haihun - Exhibition of Fine Cultural Relics from Liu He's Tomb in the Western Han Dynasty\" at Minhang Museum, showcasing 110 exquisite cultural relics with powerful \"dragon\" elements. Can you spot them all?"
  },
  {
    "id": 1775342459662241967,
    "content": "#food Savor the aroma of sesame paste noodles at an 80-year-old shop, where time-honored flavors and rich culinary traditions await! : shiyic10 #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1771658179421581476,
    "content": "#restaurants Elevate your taste buds with the delightful surprise of crab with shrimp paste and sauce! Come to Heng Xie Er Jiang where each bite is an adventure! Heng Xie Er Jiang : Yueliangnvshi #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1627517209085112321,
    "content": "#Exhibition Don’t miss Museum Of Art Pudong (MAP)’s latest exhibitions! A World of Beauty: Masterpieces from the National Archaeological Museum of Naples : until April 9th The Dynamic Eye: Op and Kinetic Art from the Tate Art Museum : until May 21st #meetinshanghai"
  },
  {
    "id": 1776444725966582036,
    "content": "#hotspot Unveil the unique allure of the Suzhou River Landscape Promenade, an otherworldly marvel reminiscent of an alien base, nestled at the intersection of Shuicheng Road and Changning Road, Changning District. : DerekChen #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1888830258670875055,
    "content": "#Exhibition At the AMBELIE GALLERY's Yunqi Kaisui exhibition, Mid-Century Modern furnishings and late Qing Dynasty screens engage in a dialogue across time, innovating aesthetic boundaries and inviting viewers to explore the fusion of tradition and modernity. No. 21, Kangping Road, Xuhui District, Shanghai : Ziyu #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1721790891554451936,
    "content": "Soon, the ginkgo leaves will turn the Shanghai streets a beautiful yellow. To see this in its most beautiful expression, you must come to Qingpu to see this \"golden carpet of fallen leaves\". Viewing places: Yihao Temple, Zhuangyan Temple, Baoguo Temple, Zhujiajiao Ancient Town"
  },
  {
    "id": 1776142729015415135,
    "content": "#tourguide Embark on a Spring Flowers Bus Tour in Xuhui! Hop on Route 926 from Xujiahui and experience the enchanting spring scenery at various stops including Wukang Building . End the tour with a delightful afternoon tea amidst the springtime splendor. #meetinshanghai"
  },
  {
    "id": 1780597086297194761,
    "content": "#activities The Villa Mahler, welcomes the \"Art+100 International Young Artist Residency Program, a platform for global cultural exchange and artistic collaboration! #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1763383661745897594,
    "content": "Make your way to Dongping National Forest Park on Chongming Island for an unforgettable rendezvous with a variety of adorable animals! : Eringg #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1764889830012469550,
    "content": "Experience the return of F1 to Shanghai after five years and feel the thrill of racing around the track! : SCOTTOR #meetinshanghai #AllInShanghai #Shanghai #F1"
  },
  {
    "id": 1612111636344496133,
    "content": "#tourguide You’ll find great books and beautiful scenery here at the Zikawei Library, located at the core of Xujiahuiyuan Scenic Area. Its two underground floors and three above ground floors hold around 800 reading seats over a total construction area of 18,650 square meters!"
  },
  {
    "id": 1777229897347588354,
    "content": "#hotspot Suzhou Creek Half Marathon Park is now open to the public, just in time for the spring bloom. Take a stroll along the scenic Suzhou Creek and immerse yourself in the natural beauty. #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1881220120002904228,
    "content": "Join Olivia Dixon as she narrates her Guzheng learning journey in Melbourne! Discover how the instrument symbolizes her deep connection to Chinese culture. #meetinshanghai #AllInShanghai #Shanghai #MyFavoriteShanghaiSeason4"
  },
  {
    "id": 1742003869960507556,
    "content": "#happynewyear #RingEveningBell #FirstAttractionofNewYear Let visiting Longhua Temple to ring the bell and wish for New Year’s blessings be your first stop in 2024! #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1619226057315606529,
    "content": "Founded in 1922, the Shanghai American School was an international school for children of overseas Americans opened from 1912 to 1949. It is now used by the 704 Research Institute (#Shanghai Institute of Shipping Equipment). No. 10, Hengshan Road: Shanghai American School"
  },
  {
    "id": 1744268315416318175,
    "content": "#hotspot Step into the century-old castle on Panyu Road, Sun Ke Villa, once the residence of Sun Yat-sen's son, exquisitely renovated to showcase the architectural mastery of Shanghai's renowned architect Hudec. Embark on a virtual tour to uncover its timeless allure."
  },
  {
    "id": 1632139857098055680,
    "content": "Built in the early 80’s the Zhuanghang Ancient Town Museum has a total area of more than 1,200 square meters. It was originally the building of Zhuanghang Supply and Marketing Cooperative, but has since been converted into various interesting exhibition halls. #meetinshanghai"
  },
  {
    "id": 1848636485580345356,
    "content": ". Fengjing Art Exploration Route: - Route Highlights: Journey through the historic Fengjing Town, known for its thousand-year-old history and rich cultural heritage. Explore the Chinese Peasant Painting Village and engage in a hands-on black pottery DIY experience at the newly opened Jinshan Art Black Pottery Research Institute. Wu Yue Square - He Feng Xi Yu Resort - Xiang Yun Aesthetic Complex - Chinese Farmer’s Painting Villages - Wu Yue Plaza"
  },
  {
    "id": 1746533173713158372,
    "content": "#tourguide Old Xuhui Citywalk—an all-in-one route for dining, drinking, and entertainment! Metro: Shanghai Library Exit 1 Wulumuqi Middle Road Changle Road Anfu Road Yuyuan Road Zhongshan Park Metro Station : Panxiaoyuaisheying #meetinshanghai #Shanghai"
  },
  {
    "id": 1642732352366592000,
    "content": "Traces of Brush and Ink TRACES OF BRUSH AND INK FENG YUAN ART #EXHIBITION : Shanghai Haipai Art Museum History Retraced: Shanghai in the Past Century : BUND 18 JIUSHI ART GALLERY 2023 Water & Ink: City Images : #Shanghai Baoshan International Folk Arts Exhibition"
  },
  {
    "id": 1625324196535607296,
    "content": "#blooms Spring is on its way to Shanghai! Come see these fantastic flower exhibitions in the meantime! Chenshan Botanical Garden Spring Flower Exhibition Time: Until February 16th Address: No. 3888, Chenhua Road, Songjiang District #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1926156208638988301,
    "content": "#blossom Get ready to experience the enchanting daisy sea in Shanghai, which is now in full bloom! With the blissful vibes of early summer overflowing, this is the perfect time to grab your friends and embark on a flower-filled adventure. Don't forget to check out the hottest spots to admire the blooms, as they create the ultimate backdrop for your summer selfies. Shanghai Exhibition Center Shanghai Expo Culture Park Minhang Cultural Park Jinxiu Culture Park Shiyuan Road #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1756977191672250570,
    "content": "#chinesenewyear Experience the ultimate Year of the Dragon celebration at the \"10,000 Dragon Art Exhibition,\" a grand showcase boasting the largest, most avant-garde, and vibrant collection of dragon-themed artworks, featuring numerous artists. Wang Xiaohui Art Museum"
  },
  {
    "id": 1647878754721734657,
    "content": "#exhibition 400 Years of Western Figure and Portrait Paintings: Collections of Tokyo Fuji Art Museum Shanghai Powerlong Museum Time: April 19th to July 23rd Address: No. 3055 Caobao Road, Minhang District #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1780521594097705294,
    "content": "#sport Check out Zhou Guanyu's F1 China Grand Prix helmet! It's decked out with Shanghai's subway map and famous landmarks. : cheshouzhouguanyu #meetinshanghai #AllInShanghai #Shanghai #F1 #Racing"
  },
  {
    "id": 1649679932812062722,
    "content": "#tourguide Camping in Guangfulin Country Park is perfect for its clean lakes, rushing rivers, rolling hills, and more. The wildflower-covered fields are waiting for you and the whole family to come connect with nature! : Suhai #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1703051774863815070,
    "content": "The 2023 Shanghai Tourism Festival is here with 200 interactive activities under 10 amazing themes!From classic re-enactments to mouth-watering dining experiences, there's something for everyone.Join us in creating unforgettable memories and make this golden autumn truly special."
  },
  {
    "id": 1641939429072809986,
    "content": "#Museum Looking for evening fun? Try these night trips to Shanghai museums and galleries for a unique viewing experience! Shanghai Museum Museum Of Art Pudong Long Museum (West Bund) How Art Museum Chi K11 Art Museum #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1874470651064676659,
    "content": "The Shanghai Changning Raffles City Minions Park has transformed into a winter wonderland! Swing by the Raffles Bell Tower to bask in heaps of fun this holiday season! : Wangailun #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1622461938679824384,
    "content": "#Exhibition Jing'an Sculpture Park Shanghai Natural History Museum \"Deep Sea Garden\" Time: from now on February 28th Location: No. 510, Beijing West Road, Jing'an District #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1619627341004808193,
    "content": "#Museum From now until February 12th, the \"Run to Glory - Olympic Spirit Exhibition\" will be held in Minhang District Museum. This exhibition showcases over 60 examples of important Olympic value. Address: No. 1538, Xinzhen Road, Minhang District #meetinshanghai #AllInShanghai"
  },
  {
    "id": 1638466796939517953,
    "content": "#tourguide Horseback adventures in #Shanghai! Aijiu Equestrian Club Address: No.999, Jibang Road, Chongming District : No. 799, Lanhai Road, Chongming District Dongping National Forest Park : No. 2188, Beiyan Road, Chongming District #meetinshanghai #AllInShanghai"
  },
  {
    "id": 1714825982064853101,
    "content": "In just a second, the computing power of the \"Siyuan No. 1\" computer cluster generates impossible calculations. Every 45 seconds, a car rolls off the assembly line at #Shanghai Tesla Gigafactory. In 60 seconds, Pudong New Area's foreign trade reaches millions. : Pudongfabu"
  },
  {
    "id": 1910618828989493415,
    "content": "#Exhibition Don't miss \" MIRRORING：Lucio Fontana与Michelangelo Pistoletto\" at Prada Rong Zhai Shanghai. This exhibition showcases the captivating works of two Italian art titans, exploring space, reflection, and viewer interaction. No. 186, Shaanxi North Road, Jing'an District : Sisu #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1783858575523086412,
    "content": "#drinks Indulge in the simplicity and beauty of tea with hot milk at the hidden gem, Kurkur, tucked away in a quaint Shanghai alley. Enjoy a warm beverage with a smiley face! : Bonjour_doona #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1703319628481745035,
    "content": "My Favorite Shanghai EP47｜Li Siqi: Shanghai - My Dearest Hometown Join Li Siqi as she explores the deep connection between Shanghai and Jewish refugees in this heartfelt episode. This journey uncovers a significant piece of history that resonates with both Jews and Shanghainese."
  },
  {
    "id": 1703617770204914047,
    "content": "The How Art #Museum in Shanghai's Zhangjiang, Pudong district is hosting three exciting #exhibitions that you shouldn't miss: - Wu Ziyang Solo Exhibition: Cloud-Native Nomadic - Friedrich Einhoff: Return To Self - Martin Wehmer: RE-COLORED No. 1, Lane 2277, Zuchong Road"
  },
  {
    "id": 1714448993483423937,
    "content": "#DiscoverShanghai Experience the charm of Shanghai's historical past at the \"Shanghai Morning\" Hall. Located in the China Securities Museum on the North Bund, this stunning reading room takes you back in time with its antique wooden bookshelves and cozy armrest chairs."
  },
  {
    "id": 1708316051904307327,
    "content": "#ShanghaiTourismFestival The Moon Rising over the Sea- Event time: September 29 - October 6 Activity: Mid-Autumn Festival and National Day Parent-child Garden Party Event location: Jinshan City Beach #meetinshanghai #AllInShanghai #Shanghai #festival"
  },
  {
    "id": 1729375567605354570,
    "content": "#HackTheMenu Get into the festive spirit with Shanghai's exclusive Christmas treats now available online! Indulge in a Christmas tree cake oozing with matcha cream and bursting with juicy strawberry bits! Nonoooo #meetinshanghai #AllInShanghai #Shanghai"
  },
  {
    "id": 1617754065483563008,
    "content": "#festival What’s not to love about Chinese culture? Come to #Shanghai and experience the Chinese New Year through these fun activities! : Shanghai Yu Garden : Guyi Garden : Nanxiang Old Street : Fengjing Ancient Town : Pier No. 3, Shiliupu #meetinshanghai #CNY"
  },
  {
    "id": 1618006101332574208,
    "content": "#food Chinese New Year’s Sweet Treats! KUMO KUMO’s Chinese New Year’s cakes come with two huge festive rabbit ears and are covered in fresh coconut! Address: B1, Meiluo City, No. 1111, Zhaojiabang Road, Xuhui District (multiple chain stores) : Songbinjintianqunale #CNY"
  },
  {
    "id": 1616257957326462976,
    "content": "#tourguide The Spring Festival is almost here! Check out these artistic exhibitions to bring in the New Year! \"Next Cultural Producer\" Season 1 \"Art Of Craft\" Excellent installations of woodcarving, painting, sculpture, and more at the Power Station of Art! #meetinshanghai"
  },
  {
    "id": 1709156841350136238,
    "content": "Experience the best of Shanghai's cold noodle scene at Si Ru Chun! For 90 years, Si Ru Chun has been a beloved restaurant, serving locals with its affordable prices and excellent cold noodles. Enjoy the smooth and chewy noodles paired with rich and mellow peanut sauce."
  },
  {
    "id": 1627893376237592576,
    "content": "#Exhibition Sun Ke Villa welcomes the first Chinese solo exhibition of Italian artist and illustrator Emiliano Ponzi. See more than 60 unique works and architectural spaces. :until March 5th (closed on Mondays) : Sun Ke Villa, Columbia Circle #meetinshanghai #AllInShanghai"
  },
  {
    "id": 1726725606363336962,
    "content": "Immerse yourself in the enchanting melodies of the Shanghai Chinese Orchestra at #CSIAF. \"The Sound Of Oriental Wisdom\" takes you on a unique musical journey set against a 360-degree immersive backdrop. Life and nature come alive through captivating Shanghai-style folk music."
  },
  {
    "id": 1620492484575993882,
    "content": "#coffees The sunlit LOAM Cafe is an ideal spot to enjoy your next cup of coffee! It’s pet-friendly and a favorite spot for cycling enthusiasts who can park their bikes on mounts in the shop! Address: No. 2596, Longteng Avenue : Mogudajiang #meetinshanghai #AllInShanghai"
  },
  {
    "id": 1633308306172264451,
    "content": "#Museum Cheng Art Museum is located in the 210,000-square-meter Elite Valley. It took 8 years to transform this old warehouse, and its building itself is a work of art. Cheng Art Museum (Pusu Art) : No. 258, Changjiang Road, Baoshan District #meetinshanghai #AllInShanghai"
  }
]