[
  {
    "id": 1676515575437361158,
    "content": "The #Hangzhou #AsianParaGames Chefs de Mission Seminar is in full swing until July 6. From event procedures to policies and facilities, it will equip the participants with the knowledge needed to ensure a successful and remarkable event for all. [/IC]"
  },
  {
    "id": 1752631737111466194,
    "content": "Leapfrogging from gaining global attention by the G20 Summit to presenting the world with a refreshing image through the Asian (Para) Games, Hangzhou achieved international recognition and reputation. Let’s discover what #Hangzhou has achieved in 2023. #CongressMoment #city"
  },
  {
    "id": 1640978336775020544,
    "content": "Hey, any #tea lovers here? The famous Longjing tea in #Hangzhou is right now welcoming its first harvest this year. Among various tea categories, such as green tea (A), white tea (B), black tea (C), and Oolong tea (D), which one do you prefer? Show us in the comments!"
  },
  {
    "id": 1707614611799982327,
    "content": "Happy #MidAutumnFestival! Get ready for a mesmerizing \"supermoon\" tonight! According to astronomical experts, the moon will shine its brightest at 5:58 pm today. Don't miss out this celestial beauty!"
  },
  {
    "id": 1708747910605947219,
    "content": "The magic of the #Hangzhou #AsianGames isn't just in the sports, it's also in the heartwarming bond between our incredible volunteers and athletes. Beyond assistance, they share stories, cultural experience and laughter that knows no boundaries. #HangzhouAsianGames"
  },
  {
    "id": 1733838855089115376,
    "content": "At the China-#Arab States Forum on Radio and #Television Cooperation, the two sides said that they will jointly implement 50 audio-visual program cooperation projects and deepen practical cooperation in policy, content, tech innovation and personnel training. #Hangzhou #technews"
  },
  {
    "id": 1702135356047630438,
    "content": "Watching misty mountains, birds flying by, and slow-moving boats at #WestLake in #Hangzhou is a great way to start the day. This place is an ideal sanctuary for visitors to escape the commotion of city life, so tune in to our livestream. #HangzhouOnCloud"
  },
  {
    "id": 1705446898700849418,
    "content": "What is your impression of #Hangzhou? Skyscrapers? Electric cars? Foreigners taking part in the Hangzhou #AsianGames share their first impression of the host city with China Daily. Watch and find out more. #HangzhouAsianGames"
  },
  {
    "id": 1924465071977062569,
    "content": "One of China's biggest fan fiction conventions \"COMICUP31\" bought in 12,000+ artists across 400+ themed zones last weekend to #Hangzhou. Cosplayers and fans have flooded the city for a national celebration of fandom. #WhatsOnHangzhou"
  },
  {
    "id": 1736348882781786333,
    "content": "They are the memoies to be cherished! The live ground light show on the final day of the BWF World Tour Finals 2023 features a review of the wonderful moments of the World Tour events in the past year. #BWF #BWFWorldTourFinals2023 #Badminton #Hangzhou"
  },
  {
    "id": 1883757609435742447,
    "content": "Discover the charm of Chinese romance hidden in the lanterns at #Hangzhou's Xixi Wetland Park! This #SpringFestival, visit Xixi Wetland and experience a unique taste of #ChineseNewYear. [Video/West Lake π Alliance & MiaoMiao Vision] #CNYinHangzhou #ChineseNewYearInHangzhou"
  },
  {
    "id": 1765323945493049628,
    "content": "Yang Huayong, professor at Zhejiang University, believes that the construction of #Hangzhou Bay Comprehensive National Science Center is not only crucial for the national innovation system, but also promotes the formation of \"new quality productive forces\". #TwoSessions"
  },
  {
    "id": 1838130007673389238,
    "content": "Global Mayors Dialogue in #Hangzhou will kick off on Sep 25. #Mayors and representatives from 24 cities across 15 countries and regions, along with envoys and domestic city representatives, will gather in Hangzhou to exchange innovative ideas on #urbangovernance and explore new paths for #sustainabledevelopment. #HiMayors"
  },
  {
    "id": 1762383317025136947,
    "content": "On Feb 24, the day of #LanternFestival, a stunning #fireworks display lit up the skies by the Sanjiangkou (the confluence of three rivers) in Yanzhou Ancient City, Jiande, #Hangzhou. #BeautifulHangzhou"
  },
  {
    "id": 1686024418936455169,
    "content": "China's game market sees a warming increase, with the actual sales revenue reaching $20.2 billion during January to June, increasing 22.2% from July to December of last year. By the end of June, the number of game players reached a record to 668 million, up 0.35% year-on-year."
  },
  {
    "id": 1786974242619506823,
    "content": "#HangzhouDiscovery | Eating #darkrice, or wumifan (#乌米饭), is a longstanding tradition in #Hangzhou on the first day of the #StartofSummer, which is May 5 this year. This special dish is made from glutinous rice and juice from sea bilberry leaves, which not only adds color and flavor but also helps protect children from mosquito bites. Do you want to learn how to cook this traditional dish? Hangzhoufeel will teach you!"
  },
  {
    "id": 1739133871961391162,
    "content": "These days, people can find a 5-meter-high rabbit made of fallen #leaves on the lawn at Sir Run Run Shaw Hospital in #Hangzhou. Students and teachers from the China Academy of Art, along with staff and patients of the hospital, collaborated to finish the creation."
  },
  {
    "id": 1818949802341835000,
    "content": "From the Seine River to #Qiantang, #Hangzhou is buzzing with Olympic spirit! Locals of all ages embrace rock climbing, yoga, and tai chi, celebrating the joy and vitality of exercise. #LivinginHangzhou #Paris2024 #ParisOlympics"
  },
  {
    "id": 1687040614570115073,
    "content": "Embark on a culinary journey at a star-rated hotel near #WestLake, where you can savor a fusion of authentic Shandong and traditional #Hangzhou cuisine with dishes like crispy fish , stewed fish with water shield, and fresh hairy crabs with green soy beans. #TastyHangzhou"
  },
  {
    "id": 1612717709825028097,
    "content": "Luciano, a Brazilian passenger on the first international flight arriving at Xiaoshan Airport after China relaxed its entry policy and fully opened its borders, has visited #Hangzhou many times. Let's check out how this city has impressed him!"
  },
  {
    "id": 1622896707569844224,
    "content": "Eight rescue experts from Rescue Team of Ramunion, a civil rescue organization from #Zhejiang Province, left for Turkey on the morning of Feb 7 with life detectors, dismantling operation tools and a rescue dog. #Hangzhou"
  },
  {
    "id": 1781925840487690597,
    "content": "This stall, with a long waiting line selling braised minced pork, is one of the street foods that appears at a random time and place. It has become a popular target for young people in #Hangzhou to pop up and have a taste. #TastyHangzhou"
  },
  {
    "id": 1860956593472610307,
    "content": "A dazzling light show lit up #Hangzhou to welcome the 2nd #LiangzhuForum! In this city where modernity meets tradition, guests from around the world are gathering to share ideas and learn about new forms of human #civilization. #5000yearsHangzhou"
  },
  {
    "id": 1682044947518873601,
    "content": "The must-eat restaurant in #Hangzhou, \"Yema\" (叶马), has opened a new store in the city. As a Michelin recommended restaurant, it specializes in serving home-style cuisine, including steamed chicken, delicate rice cakes, bouquet hairtail, crabs, and more. #TastyHangzhou"
  },
  {
    "id": 1872656171955560660,
    "content": "#Linping District International Communication Center was officially established on Dec 27, along with the launch of “Linping Style\" cross-border live streaming event. Through real-time interaction, the livestreaming showcases products and services from Linping district directly to global consumers. This approach breaks the limitations of traditional e-commerce platforms, offering businesses more precise and immediate user engagement. #Hangzhou"
  },
  {
    "id": 1622928161834156033,
    "content": "As one of the 10 famous teas in China, the West Lake Longjing tea produced in #Hangzhou is famous at home and abroad. But have you ever seen Longjing tea flowers? They only grow on tea trees over three years old and can also be made into flower tea. #TastyHangzhou"
  },
  {
    "id": 1813520860915065017,
    "content": "On July 12, a conference celebrating the 50th anniversary of the establishment of diplomatic relations between China and #Venezuela was held in Beijing. A #pastry from Linping made its debut at the conference as a tribute to the friendship between the two countries. A set of #cake plates for making pastries was also gifted to the Venezuelan Embassy in Beijing."
  },
  {
    "id": 1663545805696024578,
    "content": "An impressive architectural structure in #Hangzhou resembling a pyramid recently went viral online. The complex is set to become a hub for hotels, commercial spaces, and apartments. [/IC]"
  },
  {
    "id": 1744183271733461474,
    "content": "The Linping Grand Theatre welcomes four performances this January, including #shadowplay Journey to the West, poetic #monodrama Always Chang’an, stage #play A Dream Like A Dream and Memories of Matsuko. Let's go to the #theatre for a cultural feast!"
  },
  {
    "id": 1691684713096958256,
    "content": "#Summer days witness #biodiversity at Zhejiang A&F University. Flowers are in full bloom under the sunshine and birds are gracefully paddling by the lake. #Hangzhou"
  },
  {
    "id": 1719360579423653923,
    "content": "Louis Cha, better known by his pen name Jin Yong, was one of the greatest martial arts writers. To commemorate the 5th anniversary of his passing, an exhibition is being held at the Zhejiang Literary Center in #Hangzhou. It showcases Cha's rare manuscripts, books and photos."
  },
  {
    "id": 1720441202389188823,
    "content": "Qingshan village in Yuhang district, #Hangzhou, is embracing its status as a \"Future Rural Experimental Zone\". Its Visitor Center is a must-visit, as it seamlessly blends with nature while offering unique services such as book rentals and product displays."
  },
  {
    "id": 1738129756355523049,
    "content": "Let's welcome the #NewYear with a collective reading celebration! Join the city-wide reading event \"Twelve Months\" on Dec 31, featuring renowned calligrapher Wang Dongling writing inspiring Chinese quote: \"Read ten thousand books and travel ten thousand miles.\""
  },
  {
    "id": 1689992064564666368,
    "content": "In the first half of 2023, the per capita disposable income of all residents in #Hangzhou reached 41,053 yuan ($5,692), and the average consumption expenditure per capita was 24,266 yuan, both leading in Zhejiang province."
  },
  {
    "id": 1684556244248584192,
    "content": "After 30 years, Wang Renxiao has updated his legendary bun recipe to the next level! Now, his two talented apprentices run a trendy bun and noodle restaurant at No. 72 Wangtang Road in #Hangzhou, where they serve over 2,000 mouthwatering buns daily. #TastyHangzhou"
  },
  {
    "id": 1728022907497099571,
    "content": "Qinghefang is a well-preserved historic street that is located near the famous #WestLake. It offers a fascinating glimpse into #Hangzhou's traditions, commercial past, and folk customs. While you explore, be sure to visit some time-honored shops and restaurants! #VisitHangzhou"
  },
  {
    "id": 1663378230634762242,
    "content": "The \"most beautiful water bus\" on the Donghe River in #Hangzhou is undergoing renovations. #Hangzhou Water Bus Line 7, also known as the Donghe Line Water Bus, is renowned among tourists. The newly designed water bus, which will be capable of accommodating 20 to 24 people, is expected to be operational before the #Hangzhou #AsianGames. #BeautifulHangzhou"
  },
  {
    "id": 1678430383212314627,
    "content": "Zhejiang University Botanical Garden in #Hangzhou is the oldest botanical garden in the city, established in August 1927 by renowned botanist Professor Zhong Guanguang. It is also China's 1st modern botanical garden, nestled by the main gate of 's Huajiachi Campus."
  },
  {
    "id": 1638799647090016257,
    "content": "Lu Liqing, a folk artist in #Hangzhou, produced artistic works combining sugar paintings and paper-cutting to celebrate the upcoming Hangzhou #AsianGames. Check out this paper-cutting work called \"Welcome to Hangzhou.\" Can you recognize what attractions it depicts?"
  },
  {
    "id": 1655519642276843520,
    "content": "Tangqi Loquat, one of the most popular #fruits in #Hangzhou, has entered its harvest season. Bulk picking starts on May 8 and will last until early June. This year, Tangqi is expecting a whopping 7,500 kg of #loquats! #TastyHangzhou #foodie #yummy"
  },
  {
    "id": 1769647434203025683,
    "content": "As spring blooms in #Hangzhou, immerse yourself in the beauty of cole flower fields at Jingshan Flower Sea in Yuhang district and Baima Lake in Xiaoshan district. But that's not all! The \"Songyun Kite Festival\" will also add to the fun at Jingshan. #BeautifulHangzhou"
  },
  {
    "id": 1898231464392786326,
    "content": "When #DanielWu is a tourist on #WestLake... #Hangzhou"
  },
  {
    "id": 1631177245216722945,
    "content": "Hongcun village in #Hangzhou has become a viral destination for outdoor sports enthusiasts thanks to the hidden plum trees found in the surrounding mountains. The colorful blossoms and their delightful fragrance make it a great place for hiking.#BeautifulHangzhou"
  },
  {
    "id": 1675871268166590464,
    "content": "#Hangzhou is all about connecting people with nature.The city plans to create a series of suburban parks, making it easier for locals and urban dwellers to embrace the beauty of the outdoors. #EcoHangzhou"
  },
  {
    "id": 1688890806441295872,
    "content": "Starting Sept 10, #Hangzhou will roll out a new parenting subsidy policy. Expecting or planning on having a second child? Get ready for a subsidy of 7,000 yuan ($971). And if it's your third bundle of joy, you'll receive a subsidy of 25,000 yuan. [/VCG]"
  },
  {
    "id": 1775704846634725476,
    "content": "What happens when you take the benefits of Chinese medicine and mix it with delicious coffee? Come find out at #Hangzhou's Hu Qing Yu Tang, who opened its first #coffee shop, where you can enjoy coffee with traditional #Chinesemedicine characteristics. #TastyHangzhou"
  },
  {
    "id": 1791408323973238902,
    "content": "May 18 marks #InternationalMuseumDay. A special exhibition titled \"Bringing Cultural Relics to Life – Treasures of Hangzhou Museum\" offers people the chance to appreciate cultural relics tracing the history of #Hangzhou and get to know the stories behind them."
  },
  {
    "id": 1820772861134721125,
    "content": "A new water #tour route, which will connect the Tangqi Ancient Town, Dingshan #Lake and Chaoshan Mountain in Linping, is expected to be tested before the end of September. You can choose to take a rowing #boat or an archaistic boat to enjoy the scenery along the #route. #cityboat #Hangzhou"
  },
  {
    "id": 1784900441374880236,
    "content": "While strolling through the Qinghefang Historic Block in #Hangzhou, one can often catch a subtle whiff of #herbal scents emanating from the traditional Chinese medicine stores that now offer lotus root starch with herbal extract, ginseng coffee, and herbal aromatherapy."
  },
  {
    "id": 1640685168771072000,
    "content": "The 1st National Hand-drawn Art Exhibition opened at the Zhejiang Exhibition Hall in #Hangzhou on March 23, showcasing illustrations of famous literary works, landscape sketches, and casual literary notes. There is even an entire wall covered in creative graffiti."
  },
  {
    "id": 1904835723804762552,
    "content": "#Hangzhou's sky was recently illuminated with 1,500 drones! A breathtaking drone show over West Lake celebrated the city's legacy as the \"Capital of Love\" – blending cutting-edge tech with timeless culture. [Video/Fine-sun Media] #BeautifulHangzhou"
  },
  {
    "id": 1869382112853594237,
    "content": "The Grand Canal #Hangzhou Steel Industrial Site comprehensive conservation project is moving full steam ahead! With a total construction area of 233,600 square meters, this project aims to carefully preserve and develop key industrial relics, including the four iconic major boilers. #HangzhouStories"
  },
  {
    "id": 1656219569583947785,
    "content": "#Hangzhou Metro has a new service for travelers: FREE luggage storage at Hangzhou Xiaoshan International Airport Station! The station connects Lines 1, 7, and 19. You can easily explore the city without carrying your bags. Drop them off and enjoy a stress-free trip!"
  },
  {
    "id": 1715337067901972493,
    "content": "#Hangzhou continues to shine on the global stage! Xiajiang village in Hangzhou's Chun'an county has been named one of the \"Best Tourism Villages\" by the United Nations World Tourism Organization for 2023. #BeautifulHangzhou"
  },
  {
    "id": 1645426412721930240,
    "content": "Read the world in Hangzhou！ A spring #poetry reading event was held in quaint Xiaoying Subdistrict, attracting more than 20 domestic & overseas #literature buffs to enjoy a sunny & poetic Sunday morning with an internet celebrity English teacher in #Hangzhou. #WorldBookDay"
  },
  {
    "id": 1896515902855958776,
    "content": "Did you know that #Hangzhou is home to a variety of endangered wild animals and plants? Today is #WorldWildlifeDay, so let's take a closer look at two remarkable examples in Hangzhou and appreciate the unique beauty of our local natural heritage. #EcoHangzhou #Biodiversity #WCBR2025 #WCBR"
  },
  {
    "id": 1645743499025985536,
    "content": "\"5G #AsianGames Team\" kicked off! , an official partner of the , aims to promote the concept of \"#5G + all sports\" to support the digitalization and intelligentization of the Games and people's daily lives. [/IC Photo]"
  },
  {
    "id": 1868959327824044251,
    "content": "The Utopia Bookstore on #Hangzhou's Yan'an Road has gained unexpected popularity just before its closure. The owner decorated the store with vibrant yellow ginkgo leaves, creating a cozy autumn-winter vibe indoors. #VisitHangzhou"
  },
  {
    "id": 1787471671668191692,
    "content": "“We’re far away from our home country but this event makes us connected,” said Asma Binti Cholis, President of the Hangzhou Indonesian Students Community (HISC). On May 5, hundreds of students from #Indonesia and beyond gathered at #Zhejiang University of Technology's Pingfeng Campus for \"INA DAY: Tresna Sujati,\" the biggest Indonesian cultural fest in #Hangzhou organized by HISC. It was a full-on celebration with a cultural #bazaar and awesome stage shows, all knitting the international student community closer together in Hangzhou."
  },
  {
    "id": 1912071774663225758,
    "content": "Massimo Ambrosetti, Italy's ambassador to China, delivered a inspiring speech at the 2025 #Hangzhou Spring Music Festival. He hoped the music gala would spark curiosity and a deeper love of #Italy and for its rich artistic heritage. \"Let the music bring us closer,\" the envoy said. #WhatsOnHangzhou"
  },
  {
    "id": 1834981972126711913,
    "content": "Tonight, the newly renovated Yijin #Street in Lin'an district officially opens! Once known as Lin'an's \"No. 1 Street\", it now spans 2,500 meters and features artistic shops, local eateries, and 19 cultural spots showcasing Lin'an and Wuyue #culture. A stroll down the street offers a delightful mix of food, art, and history. #Hangzhou"
  },
  {
    "id": 1747151705593323642,
    "content": "Some convenience stores in #Hangzhou have introduced a \"Hot Cooking\" section featuring freshly made items such as hot-pressed sandwiches and braised beef noodles at reasonable prices, and they are becoming popular. #TastyHangzhou"
  },
  {
    "id": 1799018486980829557,
    "content": "On June 6, the inaugural \"Qiubai Short and Medium-Length Reportage #Literature Award\" ceremony was held at Hangzhou's Gongshu Canal Sports #Park. The award celebrates the 10th anniversary of the #GrandCanal's #UNESCO status, and the ceremony will be permanently hosted in Gongshu, #Hangzhou."
  },
  {
    "id": 1710312332424016207,
    "content": "The #wrestling event of the #Hangzhou #AsianGames has officially kicked off in the gymnasium of the Lin’an Sports Culture and Exhibition Centre. The first day ushered in 2,600 spectators, with the venue echoing with the cheers."
  },
  {
    "id": 1853421947209896062,
    "content": "The Hangzhou municipal bureau of commerce announced that #Hangzhou's foreign #trade for the first three quarters of 2024 reached a total of 595.3 billion yuan ($83.6 billion), marking a 6.7-percent year-on-year increase. Learn more: #HangzhouBiz"
  },
  {
    "id": 1703725306014781509,
    "content": "On Sept 16, the #Hangzhou West Lake Museum reopened with a fresh look to welcome the #AsianGames, offering an immersive experience with state-of-the-art 3D and projection technology designed to help visitors delve into the beauty and history of #WestLake like never before!"
  },
  {
    "id": 1734196339603652614,
    "content": "Save the date: Dec 30! \"Shuke & Beta: Pentagon Flying Saucer,\" produced by #Hangzhou King of Fairy Tales Film and Television, is landing in theaters nationwide! Get ready for a cinematic journey with surprises from this widely-known IP! #WhatsOnHangzhou"
  },
  {
    "id": 1926140081623941238,
    "content": "Around 100 international students embarked on a unique cultural experience at #Zhejiang Chinese Medical University. From blending herbs to baking Bazhen Cake, they got a real taste of Traditional Chinese medicinal food culture, which is cool and fun! The Gen Z City Experience Officer event, co-hosted by Hangzhou Communication Center, witnesses how ancient health wisdom meets youthful energy as TCM goes global. #Hangzhou #TCM #5000yearsHangzhou"
  },
  {
    "id": 1851927094701482428,
    "content": "With the theme of \"Proposal\", the 2024 Asia Design Management Forum & Art Design Media Festival will kick off on Nov 7 at Wulin Constellation, #Hangzhou. This year's ADM introduced \"The Endless Dream\" Immersive Exhibition by Grand Palais Immersif, \"pop-up style\" exhibition of artist Lucy Sparrow and more. #WhatsOnHangzhou"
  },
  {
    "id": 1771593613778235824,
    "content": "The sharing session themed with “Sound & Scents”, one of series activities of Sino-French Perfume #Culture Year, #Hangzhou, was launched with a perfume panel and olfactive master class at the Winland Center on March 23. The artists from China and France share their insights on #perfume inspirations and enjoy the scents accompanied with each piece of corresponding music. #France"
  },
  {
    "id": 1901933747110658060,
    "content": "The 2025 National Indoor Track and Field Championships recently concluded, with rising track star Xu Hui from Fuyang, #Hangzhou, clinching both the women's 1,500m and 3,000m gold medals with times of 4:18.53 and 9:20.99, making her the \"double champion\" of the event. Congrats! #HangzhouStories"
  },
  {
    "id": 1896863191516561552,
    "content": "Under the wonderful embrace of #spring blossoms, let's embark on an outing celebrating the season. In #Hangzhou, the wild cherry blossoms are most abundant in Sandu town in Jiande. And currently, about a third of the cherry blossoms in Datang village have bloomed, while many remain in bud. #BeautifulHangzhou"
  },
  {
    "id": 1712481251414901056,
    "content": "Hangzhou Metro Line 10 Phase III is gearing up for construction! Once complete, it will seamlessly connect #Hangzhou and , Huzhou, forming a one-hour travel loop and fast-tracking the integration of Hangzhou's northern gem with Deqing county. [/VCG] #VisitHangzhou"
  },
  {
    "id": 1870038941543608403,
    "content": "Jiande native Zhang Jian has achieved another incredible feat! After summiting Mount Everest, he trekked 112 kilometers over seven days to reach the South Pole and ascended Mount Vinson, Antarctica's highest peak at 4,893 meters above sea level. #Hangzhou #HangzhouStories"
  },
  {
    "id": 1838533843340710128,
    "content": "The weather in #Hangzhou cooled down as soon as the solar term #AutumnalEquinox arrived. The air is now filled with the sweet aroma of freshly roasted #chestnuts. The warm, sugar-roasted treat brings out the sweetness, softness, and fragrance of the season. #TastyHangzhou"
  },
  {
    "id": 1873715666378957107,
    "content": "Recently, the drug ensartinib hydrochloride – jointly developed by Linping-based Betta Pharmaceuticals and its wholly-owned unit Xcovery – won approval for marketing by the US FDA, for the treatment of patients with advanced non-small cell lung cancer or NSCLC with ALK mutations."
  },
  {
    "id": 1835548596592365605,
    "content": "Join us as we dive into pickle-and-pork #mooncakes making at Friendship Hotel #Hangzhou! Will the perfect combination of flaky pastry, savory pork, and pickled mustard greens win them over? Watch as international food enthusiasts try their hands at this iconic #MidAutumnFestival delicacy!"
  },
  {
    "id": 1797629316706243004,
    "content": "On June 2, the Wuchang #DragonBoatRace kicked off in #Hangzhou's Xixi Wetland. Amid the cheers of spectators on the banks, five performing dragon boats and eight competitive dragon boats made dazzling appearances, putting on a show as they braved the wind and the waves."
  },
  {
    "id": 1925800681622954481,
    "content": "How can you get your local short videos more international appeal? Let's hear the inspiring stories shared by three young directors from #Hangzhou! #5000yearsHangzhou"
  },
  {
    "id": 1925144550734999564,
    "content": "The first wave of West Lake's 2025 #lotus blossoms has emerged! Spotted at iconic spots like Autumn Moon over the Calm Lake, Hougushan, and Viewing Fish at Flower Pond, the flowers are a sure sign that #summer is near. #BeautifulHangzhou"
  },
  {
    "id": 1876207083592585403,
    "content": "In 2024, #Hangzhou Xiaoshan International Airport welcomed 48.05 million passengers, with an average daily flow of 131,000 – a 16.7% increase from the previous year. Its global network now connects 21 countries, and the airport achieved multiple new transport records. #VisitHangzhou"
  },
  {
    "id": 1789964809091584004,
    "content": "The Qingliang Peak National Reserve in Lin’an, #Hangzhou recently welcomed its first South China sika deer fawn of the Year of the Dragon. The South China sika #deer is a nationally protected wild animal listed as endangered on the International Union for Conservation of Nature (#IUCN) Red List of Threatened Species. #EcoHangzhou"
  },
  {
    "id": 1928088944962589109,
    "content": "Themed \"Metamorphoses\", the 2025 Graduation Season will kick off on June 1. This year's #exhibition spans six major venues, including CAA's Nanshan, Xiangshan, and Liangzhu campuses, as well as the World Tourism Museum, Zhejiang Art Museum, and Quan Shanshi Art Center. What's more, selected graduation works will be featured on large screens across #Hangzhou's all-media exhibition zone. #WhatsOnHangzhou"
  },
  {
    "id": 1851972394614980718,
    "content": "#Hangzhou's Hubin Pedestrian Street celebrated #InternationalPandaDay on Oct 27 with a stunning display of nearly 300 blue-and-white and black-and-white #panda sculptures. The 1864 Panda Exhibition art installation aimed to raise public awareness about biodiversity conservation and sustainable development. Learn more: #WhatsOnHangzhou"
  },
  {
    "id": 1901936620900905050,
    "content": "Spring is the perfect season to bike through #Hangzhou's Lin'an district! The Qingshan Lake Scenic Area and Datianmu scenic loop offer an ideal blend of nature and exercise. Looking for a challenge? Take on the Zhexi Sky Road – a 139-kilometer route with an elevation gain of over 1,800 meters. #VisitHangzhou"
  },
  {
    "id": 1845125115744506015,
    "content": "From Oct 19 to 22, the 2024 International Association for the Protection of Intellectual Property (#AIPPI) World Congress will be held in #Hangzhou, marking the first time the event to be hosted in China in AIPPI's 127-year history. \"The AIPPI World Congress will take place during the most beautiful season in Hangzhou,\" said Xu Weihua, Vice Mayor of Hangzhou, at a press conference recently hosted by the China Council for the Promotion of International Trade (CCPIT) in Beijing. \"We aim to deliver a high-standard, professional event that showcases the Chinese vision, Hangzhou's unique charm and its global influence.\" (ZICC: Jiang Qian) #WorldCongress"
  },
  {
    "id": 1790325046856364238,
    "content": "According to the latest version of the application guide for the living allowance for fresh graduates issued by #Hangzhou, both part-time and full-time graduate students now enjoy the same #talent subsidy policy. Additionally, those employed in the districts and counties of western Hangzhou can apply for subsidies after three years of work."
  },
  {
    "id": 1706943224680735049,
    "content": "The #Hangzhou #AsianGames Village established an online platform called \"low-carbon account\" to promote low-carbon living. Residents of the village can earn points through eco-friendly activities and then exchange them for a variety of rewards."
  },
  {
    "id": 1871556440336548164,
    "content": "Celebrate the #NewYear with a walk along the #GrandCanal! The Walking Exercise to Embrace New Year's Good Fortune 2025 will begin on Jan 1. The event features three 7-kilometer routes, starting from Wulin Square, Wulinmen Wharf, and Yiqiao Old Street, respectively. #WhatsOnHangzhou"
  },
  {
    "id": 1778617658491166945,
    "content": "A new boarding location at the #Hangzhou West Coach Station has been added to the coach route to Shanghai Pudong International Airport. The bus stops at PVG six times a day. The services are also available from Wulinmen Station and the East Railway Station Bus Terminal."
  },
  {
    "id": 1796149563981738210,
    "content": "The International Canoe Federation has inaugurated a new satellite office in #Hangzhou on May 29 to support the growth of paddle #sports in Asia. The #ICF's Hangzhou office will provide additional support to the headquarters team in the Olympic Capital of Lausanne, Switzerland."
  },
  {
    "id": 1844392448510001350,
    "content": "On Nov 1 and 2, the 20th Xihu #Music Festival will be held at Prince Bay Park in #Hangzhou, featuring an exciting lineup that includes the Japanese band MONDO GROSSO, special guest HIKARI MITSUSHIMA, and performances by betcover!! and She Her Her Hers, among others. #WhatsOnHangzhou"
  },
  {
    "id": 1904110454898897204,
    "content": "Get the latest outdoor camping gear! From Mar 28 to 30, the #CLE2025 #Hangzhou International Camping Life Expo will take place at the Hangzhou Grand Convention & Exhibition Center. With 500+ global outdoor brands participating, you'll not only get hands-on experience with the newest camping gear but also learn about wilderness conservation, first aid, and more. #IntlEventCity #IntlEventCityHZ #TheEventCity"
  },
  {
    "id": 1833128225616306286,
    "content": "As of August, a total of 44 #Hangzhou listed companies in Zhejiang province have disclosed ESG reports, while another 37 have disclosed social responsibility reports or sustainable development reports. Environmental friendliness, rural vitalization, social services, employee growth and talent development are among the recuring themes in the reports. #HangzhouStories"
  },
  {
    "id": 1916427180353216588,
    "content": "Apr 25 marked the debut of Hangzhou’s cultural treasures at the 89th MIDA in Italy. From dazzling silk art to ancient Liangzhu symbols reimagined as chic decor, the craftsmanship meets innovation, where live workshops, panda-themed designs, and more—tradition with a modern heartbeat! #HangzhouCrafts #MIDA2025 #Hangzhoufeel #CreativeHangzhou #HangzhouCraftsInFlorence"
  },
  {
    "id": 1913252026542334219,
    "content": "Mark your calendars for May 7-26 as the Panorama du #cinéma français will tour to #Hangzhou. The event is honored to have the renowned French actress #IsabelleHuppert serve as the promotional ambassador. French films including LE COMTE DE MONTE-CRISTO, MARCELLO MIO and MARS EXPRESS are come to Broadway Cinemas Kerry Center and Jinsha InCity in Hangzhou! Tickets go live on April 22 (Tuesday), don’t miss out!"
  },
  {
    "id": 1848680703476867083,
    "content": "The 2024 Qiandao Lake Creative Life Week will take place from Oct 24 to 28 at Xiushui Square in #Hangzhou's Chun'an county, featuring themed cultural exhibitions, intangible cultural heritage displays, and gourmet fairs, among other activities. Cultural enterprises from countries like the UK, France, Italy, and Spain are also invited to participate. #WhatsOnHangzhou"
  },
  {
    "id": 1925031590138413385,
    "content": "Egrets flew in Ankang! #BiodiversityDay #MyNatureMoment"
  },
  {
    "id": 1871541339374137554,
    "content": "What's your plan for the last weekend of 2024? Xiangfu Old Street in #Hangzhou's Gongshu district will host a Chinese-style festival from Dec 28 to 29, featuring a 4-meter-long fish lamp parade on the first day. Additionally, a wish balloon release event will light up #NewYear's Eve. #VisitHangzhou"
  },
  {
    "id": 1904467112573506003,
    "content": "See you at the game tonight!"
  }
]