[
  {
    "id": 1676515575437361158,
    "content": "The #Hangzhou #AsianParaGames Chefs de Mission Seminar is in full swing until July 6. From event procedures to policies and facilities, it will equip the participants with the knowledge needed to ensure a successful and remarkable event for all. [/IC]"
  },
  {
    "id": 1708000106195402792,
    "content": "Watch Wissal, an international student from #Hangzhou Dianzi University, take on the #AsianGames fencing challenge! Check out her vlog for the thrilling moments and hear what her fellow international friends have to say about the unforgettable experience. #HangzhouAsianGames"
  },
  {
    "id": 1626462799030538246,
    "content": "The Tianmu #Mountain is full of natural wonders with a wide variety of rare #species. There are 74 kinds of nationally protected #animals in the reserve, such as Anji microsalamander, white-necked pheasant, and Luehdorfia. #biodiversity #nature #Hangzhou #LinAn"
  },
  {
    "id": 1669178194396868609,
    "content": "Today marks the 100-day countdown to #Hangzhou #AsianGames. International friends in Hangzhou are inviting you to celebrate the upcoming Games together. See you in Hangzhou!"
  },
  {
    "id": 1803065133150711843,
    "content": "To celebrate the 10th anniversary of the #GrandCanal's #UNESCO World Heritage inscription, the dance drama \"To Meet the Grand Canal\" was performed for three days at the #Hangzhou Grand Theatre, marking the 10th anniversary of its premiere."
  },
  {
    "id": 1645441509653901314,
    "content": "The rosa banksiae ait #flowers, commonly named Lady Banks' rose, are in full bloom in #Hangzhou's Liu Park near West Lake! The yellow petals are tiered like a cascade, forming a fascinating landscape. #BeautifulHangzhou"
  },
  {
    "id": 1656573626521460736,
    "content": "Can you spot the boats and islands that dot the #QiandaoLake in #Hangzhou, #Zhejiang? It is #China's largest man-made lake, and forms part of the country's largest forest park. The 1,700 plant species here contribute to the 93% of Hangzhou’s forest coverage rate. [/CGTN]"
  },
  {
    "id": 1907351362247213192,
    "content": "FREE Trip Alert! #Hangzhou, China is inviting 10 global explorers for an all-expenses-paid journey through 5,000 years of history! Walk through UNESCO heritage sites Meet locals & share cultures Get global exposure Want in? Share your insights on Hangzhou or your city with your photos or videos and tell us why you should be chosen! Use #5000yearsHangzhou & RT to spread the word! Learn more: #5000yearsHangzhou #WinATrip #HistoryComesAlive"
  },
  {
    "id": 1618609829001498624,
    "content": "#CNY wishes from the UK! Hangzhou native Jingjing who is studying in London now plans to make New Year's Eve dinner with her classmates. How will you celebrate the new year? #SpringFestival #ChineseNewYear #ChineseNewYear2023"
  },
  {
    "id": 1766445351177957450,
    "content": "A big welcome to Daria, Hangzhoufeel’s AI anchor! She is presenting you with the buzzwords of China's Two Sessions this year in English, Spanish, Russian, and more languages. Check it out to see what's in today’s episode！ #Hangzhou #Hangzhoufeel #AIavatar #AI"
  },
  {
    "id": 1900390733955452935,
    "content": "At the opening ceremony of K1 Premier League #Hangzhou, the Lantern Dance, an intangible cultural heritage of Linping, fueled the passion of the audience, which was followed by a #karate show by over 100 #sports enthusiasts and children. #IntlEventCityHZ #IntlEventCity #TheEventCity"
  },
  {
    "id": 1900360098888732943,
    "content": "Experience the sublime beauty of #spring at Wenjia Mountain village in #Hangzhou! Join us in celebrating nature's bounty and the ancient tradition of harvesting #tea leaves amid the idyllic landscape of lush greenery. #HangzhouOnCloud"
  },
  {
    "id": 1761239275595759686,
    "content": "Happy #LanternFestival! Let’s enjoy the fun of #riddles！Riddle-solving has been a tradition during the #festival for centuries, with riddles written on #lanterns challenging participants’ intellect.Tell us your answers in the comments and win the gifts！#Hangzhou"
  },
  {
    "id": 1838796374906929651,
    "content": "Let's really enjoy the gala for the #digitaltrade! The opening ceremony of the 3rd Global Digital Trade Expo is being launched in #Hangzhou on the morning of Sept 25. #GDTE #3rdGDTE"
  },
  {
    "id": 1626497088363307009,
    "content": "The Hangzhou #AsianGames Organizing Committee announced on Feb 12 that #6G technology will be used in the in #Hangzhou, aiming to create a high-tech and intelligent sporting event. [/Lu Wei]"
  },
  {
    "id": 1693974807833125020,
    "content": "With the scorching heat finally subsiding, it's the perfect time to step out and enjoy the blooming flowers. Make the most of summer's final days to enjoy #Hangzhou's dazzling lotuses, which are still in full bloom! #BeautifulHangzhou"
  },
  {
    "id": 1842561016942739620,
    "content": "Join the chorus as international youth singers and students sing the English version of #Hangzhou’s city anthem Dream Paradise in a #music flash mob activity to celebrate the National Day #holiday. #nationaldayholiday #happyholidays #holidayinHZ"
  },
  {
    "id": 1637786066714517506,
    "content": "At the Fenglai Ridge of Xukou town, Fuyang district, #Hangzhou, the century-old wild pear trees are growing dense blooms, looking like a blazing oil painting in real life from a distance. #BeautifulHangzhou"
  },
  {
    "id": 1653398941298311172,
    "content": "Thousands of acres of azaleas on a mountain in #Hangzhou are in full #bloom! The azaleas are like red ribbons dotting the green hills, bringing the breath of spring!"
  },
  {
    "id": 1796496852701118641,
    "content": "The 20th China International Cartoon & Animation Festival's Chinese Style Brand Ceremony recently concluded in #Hangzhou. This year's ceremony showcased traditional #culture in diverse ways, delivering an exquisite cultural feast. #20thCICAF"
  },
  {
    "id": 1737684320222142859,
    "content": "With its long history, rich intangible heritage, and strong red culture, #Hangzhou's Qingliangfeng town is a must-visit. Visitors here can learn about ancient relics, explore cultural sites, and see more than 1,000 ancient trees! #VisitHangzhou"
  },
  {
    "id": 1685967042627985408,
    "content": "An exhibition entitled \"Ritual Matters, Bronze Age Civilizations in the Central Plains\" made its debut at the Liangzhu Museum in #Hangzhou recently, showcasing the ceremonial and musical civilization of the Xia, Shang, and Zhou dynasties (c.21st century-256BC). [/IC]"
  },
  {
    "id": 1683424796900753410,
    "content": "A Fuxing bullet train specially designed for the #Hangzhou #AsianGames rolled off the production line on July 21 in Changchun, . It will run between Hangzhou and the five co-host cities of , Wenzhou, Jinhua, and Huzhou during the event."
  },
  {
    "id": 1661720527638241281,
    "content": "#Hangzhou is seeing some major construction with the addition of four new high-speed train stations and four high-speed railways. Once completed, the city will boast a total of 15 stations and 11 railways, aiming to establish a convenient \"1-hour traffic circle\" within Zhejiang."
  },
  {
    "id": 1816458384025301457,
    "content": "#Hangzhou's Yuhang district recently released its economic performance states for the first half of 2024, maintaining its position as the top economic performer in #Zhejiang. With a regional #GDP of 161.55 billion yuan ($22.24 billion), it accounts for 15.94% of the city's total."
  },
  {
    "id": 1768502388896473223,
    "content": "Blooming magnolia #flowers of different varieties and colors transform #Hangzhou into a fragrant gallery of floral splendor. Many pink flowers have been spotted on a magnolia tree by the No 1 building of West Lake State Guesthouse. #BeautifulHangzhou"
  },
  {
    "id": 1721835892787286438,
    "content": "The fertile fields of Shunhu village in Puyang town, Xiaoshan district, #Hangzhou are now at their most splendid. The golden rice heads bow gracefully, laden with grains, while two harvesters traverse the fields. [/VCG] #RualVitalization"
  },
  {
    "id": 1639939834012905472,
    "content": "The #WestLakeLongjingTea Stir-frying Competition of Xihu district was divided into a \"preliminary round\" and a \"final round\". It's conducted through on-site contests and evaluations based on appearance, aroma, taste, tea soup color, and dregs. The youngest contestant is 18 yrs"
  },
  {
    "id": 1645411312502214665,
    "content": "The 1st batch of Chinese roses is expected to bloom on #Hangzhou's overpasses from April 15! The city has planted 2.15 million Chinese roses on the elevated area for years, creating an appealing view for its residents and visitors. #BeautifulHangzhou"
  },
  {
    "id": 1616072992068624386,
    "content": "The first double-decker tunnel in Zhejiang province – the North Lishui Road Tunnel in the north part of #Hangzhou – has opened to traffic. The first layer of the tunnel will connect to the underground space after the completion of the Grand Canal Bay Complex."
  },
  {
    "id": 1640307682598064128,
    "content": "According to the latest Hurun Global Rich List, Zhong Shanshan, the founder of Nongfu Spring, a bottled water company based in #Hangzhou, retains his position as China's wealthiest individual, with a net worth of $69 billion. #HangzhouBiz"
  },
  {
    "id": 1672906350194724865,
    "content": "Following the exciting dragon boat race, Luojiazhuang village in #Hangzhou recently set up a special banquet for its residents with over 300 tables, signifying the resumption of this annual village highlight. After a three-year suspension, the grand event finally returned, gathering over 2,700 people to celebrate the #DragonBoatFestival. #WhatsOnHangzhou"
  },
  {
    "id": 1731679757492724061,
    "content": "The lively and adorable digital spokesperson BinKOL made its debut on #Hangzhou's Hubei Pedestrian Street! BinKOL is a novel way to engage consumers, combining the charm of a digital ambassador with the vibrant atmosphere of the Street. [/IC] #VisitHangzhou"
  },
  {
    "id": 1819381766760628510,
    "content": "Defending champion, Zhejiang swimmer Wang Shun advanced to the final of the Men's 200m individual medley at the #ParisOlympics. The final will take place on the evening of Aug 2 local time. Let's cheer for him! #Swimming #Hangzhou"
  },
  {
    "id": 1748253967560343665,
    "content": "This iconic spot is getting an upgrade! Bailongtan Creek in Xihu district, #Hangzhou, is transforming by restoring the city's only #waterfall and introducing Hangzhou's 1st animal-themed forest resort hotel. The upgraded Bailongtan Scenic Area will open its doors this year."
  },
  {
    "id": 1663436797702193152,
    "content": "Surrounded by clear water, Lin'an has #bridges of wonderful shapes offering travel convenience and unique scenery to the #city. #Hangzhou"
  },
  {
    "id": 1697616805718868193,
    "content": "Manufacturing in #Hangzhou is continuing to gather strength. From January to July, the value-added growth of Hangzhou's equipment manufacturing industry reached 8.4%, outpacing the growth rate of 7.0 percentage points for industrial added value above a designated size."
  },
  {
    "id": 1682028089298288640,
    "content": "Looking to cool down this summer? Experience a unique journey along the Xin'an River in #Hangzhou's Jiande. A group of electric tour boats, designed to look like bamboo rafts, has been put into operation and are ready to provide visitors with some refreshing summer fun."
  },
  {
    "id": 1783450887631032474,
    "content": "The recently released \"Longjing Tea Sensory Grading Standard Samples\" set is China's first official standards for Longjing #tea. Each set comes in six grades: Special, Grade One, Grade Two, Grade Three, Grade Four, and Grade Five. #Hangzhou"
  },
  {
    "id": 1813166695885992290,
    "content": "Rare and magical! Witness the breathtaking twin lotus flower blooming in West Lake, #Hangzhou. With just a one in 100,000 chance of blossoming, it's believed to bring continuous good luck! #BeautifulHangzhou"
  },
  {
    "id": 1676203960976445440,
    "content": "#Hangzhou is ready for a vibrant \"Sleepless Shopping Paradise\" by revitalizing its nighttime economy. The city aims to make a full use of its cultural heritage and entertainment offerings to create a captivating and unique nighttime experience."
  },
  {
    "id": 1876252383841538289,
    "content": "On Jan 5, a new high-speed train route connecting #Hangzhou West Railway Station and Hong Kong West Kowloon Station was unveiled. The train departs from Shanghai Hongqiao at 13:53, stops at Hangzhou West Station at 15:10, and arrives at Hong Kong West Kowloon Station at 21:56. #HangzhouStories"
  },
  {
    "id": 1759869251933048848,
    "content": "Cherry blossoms are making an early appearance! While the peak season is usually in late March, some eager early-blooming #cherry blossoms can't wait and are already gracing places like #Hangzhou Botanical Garden and Taizi Bay Park. #BeautifulHangzhou"
  },
  {
    "id": 1717171756719624456,
    "content": "Zhinan #Village in Lin’an district, #Hangzhou is known as a paradise for photography lovers. The #autumn color of the mountain trees and rice fields depicts the village as an oil painting, attracting tourists to stop and linger."
  },
  {
    "id": 1648227616485429250,
    "content": "In Linping, the #greenway at the doorstep stretches for hundreds of miles. You can #walk in the early morning to feel the mild breeze or go for a stroll in the nightfall to enjoy the sunset. #sports #Hangzhou #AsianGames"
  },
  {
    "id": 1894685067550879880,
    "content": "The 62nd Plenary Session of the Intergovernmental Panel on Climate Change (#IPCC) kicked off in #Hangzhou on Feb 24, during which the IPCC's 7th Assessment Report was unveiled. [Photo/Tang Kai] #WhatsOnHangzhou"
  },
  {
    "id": 1734543624455791071,
    "content": "During this time of the year, the metasequoia trees at Xianghu Lake in #Hangzhou look stunning. The sun shining on the forest creates a beautiful array of colors, making it a sight to behold. #winter #BeautifulHangzhou"
  },
  {
    "id": 1695082858648646104,
    "content": "An exhibition showcasing traditional hand-made paper-making techniques, especially from Fuyang, China's paper-making hometown, is underway at Fuyang Museum in #Hangzhou. Make sure to visit before Sept 6. #WhatsOnHangzhou"
  },
  {
    "id": 1666111349875961856,
    "content": "Here, the visitors can see badges, mascot dolls, silk scarves, stationery and other well-designed licensed products of the #AsianGames, and can also participate in on-site interaction and receive mysterious gifts. The mascots Cong Cong, Chen Chen and Lian Lian will welcome visitors at the entrance of the #exhibition hall. #ICIF"
  },
  {
    "id": 1772892566905851967,
    "content": "Visitors can now visit the Zhejiang Culture Center in #Hangzhou with their valid IDs without reservation except on weekends and holidays. The center offers a one-stop exploration of the library, museum, intangible cultural heritage hall, and literature museum. #VisitHangzhou"
  },
  {
    "id": 1874047855780127066,
    "content": "Looking for #weekend plans? Then visit Gallery Street by the Grand Canal! Explore four exciting exhibitions now on display: Kengo Kuma's architecture, \"Dreamscapes\" by young Chinese & French artists, \"Blossoms of Grasse\" celebrating perfume artistry and a Giacomo Puccini centenary exhibition with Guerlain perfumes & Turandot costumes."
  },
  {
    "id": 1627601221782749185,
    "content": "Bamboo shoot #soup garnished with fresh and pickled streaky pork is a tasty dish that commonly appears on the dinner table of local #Hangzhou people during the springtime. Made with fresh spring bamboo shoots and high-grade ham, this dish delights both your eyes and stomach."
  },
  {
    "id": 1687072829316153344,
    "content": "A white-eared night heron (Gorsachius magnificus) was found entangled in a fishing line on a farm near #Hangzhou's Qingliangfeng National Nature Reserve . After being rescued, it was released into the wild. [/VCG] #EcoHangzhou"
  },
  {
    "id": 1887085063701176479,
    "content": "Tourists at #China #Harbin Sun Island International Snow Sculpture Art Expo joined a lively Bunny Hop dance chain, defying the -16°C chill and breaking a sweat with their energetic moves.#Harbin2025 #9thAsianWinterGames"
  },
  {
    "id": 1764946458955202609,
    "content": "Now, you can experience #freediving in Hangzhou! The abandoned gas storage tanks of #Hangzhou Iron and Steel Group Company have been transformed, maintaining their original shape on the outside while being converted into an indoor diving pool with a depth of 27 meters."
  },
  {
    "id": 1732695500485452088,
    "content": "A group of int'l students from Zhejiang Gongshang University joined the League of Int'l Students and embarked on a journey to Yungu Campus in #Hangzhou to explore a new type of research university, the first of its kind in the history of China. #HangzhouExpats"
  },
  {
    "id": 1645743499025985536,
    "content": "\"5G #AsianGames Team\" kicked off! , an official partner of the , aims to promote the concept of \"#5G + all sports\" to support the digitalization and intelligentization of the Games and people's daily lives. [/IC Photo]"
  },
  {
    "id": 1770373822354784595,
    "content": "A collision between #ACG and traditional culture! The 12th ComicMe held last weekend at #Hangzhou's White Horse Lake International Convention and Exhibition Center saw a great reunion of famous animation IPs, well-known cosplayers, and a large number of ACG enthusiasts."
  },
  {
    "id": 1663375798513045505,
    "content": "With hills, basins, waters, and other landforms, Qingshan Lake National Forest Park in #Hangzhou is a natural beauty for a wildlife environment. According to a pending survey, 1,248 species of seed plants and 1,553 species of animals are reported to be found in Qingshan Lake. The bird resources are found to be the most prosperous, including over 10 national-level protected species. #EcoHangzhou"
  },
  {
    "id": 1814268955391152196,
    "content": "The water level of the Qiantang River in #Hangzhou has dropped noticeably. From Pengbu Bridge to Liuhe Park, a large beach is exposed along the river. The color of the river, from the bank to the river, appears dreamily yellow, light green, and turquoise. #BeautifulHangzhou"
  },
  {
    "id": 1666404892892856320,
    "content": "#Hangzhou has been committed to the treatment of West Lake's #water environment. The lake's water ecosystem has improved through the planting of water plants in the lake bed, where a 317,000-sqm underwater forest has been formed after years of effort."
  },
  {
    "id": 1666089566737162243,
    "content": "The 2022 #Hangzhou Ecological Environment Bulletin has been released! In this latest \"report card\", Hangzhou boasts the highest water quality score, while also showing off the achievements of its acid rain control and dust reduction efforts. [/IC] #EcoHangzhou"
  },
  {
    "id": 1641817631929012226,
    "content": "At Qingliang Peak in #Hangzhou, a baby yellow muntjac that had been rescued by a ranger was seen bumping into the same ranger at the water's edge! This is the little muntjac's first #spring back in #nature, and it appears to be as lively as ever. #EcoHangzhou"
  },
  {
    "id": 1641409943168495616,
    "content": "Top athletes from all over China gathered at the Fuyang Water Sports Center in #Hangzhou to compete in the National Canoe Sprint Spring Championships 2023 on March 28. It was this year's first competition held at an #AsianGames venue. [/IC] #WhatsOnHangzhou"
  },
  {
    "id": 1663082118057177090,
    "content": "Can you guess how many items are found at #Hangzhou Xiaoshan International Airport every day? Recent data shows that the airport deals with an average of more than 120 lost and found items daily, with a maximum of 169 items. The most frequently misplaced items are laptops, mugs, power banks, and ID cards."
  },
  {
    "id": 1922622932963971200,
    "content": "#Loquats are ripening and ready to pick! Known for their tender, juicy texture and sweet flavor, these golden fruits are a seasonal favorite. Loquats in areas like #Hangzhou's Chun'an county and Linping district are approaching harvest season — perfect for a weekend fruit-picking trip with family or friends. #TastyHangzhou"
  },
  {
    "id": 1925869322183868441,
    "content": "A serene pond at Yongfu Temple, #Hangzhou, has gone viral! Visitors are flocking to capture the dreamlike underwater scenes — vibrant hydrangea petals swirling in crystal-clear water, bubbles sparkling in the sun, and reflections of blue skies and green trees. Pro tip: Shoot underwater for the full magic. #BeautifulHangzhou"
  },
  {
    "id": 1735223984009167163,
    "content": "With a total length of 22.68 kilometers, the Grand Canal Loop #Road is composed of roads at county, township and #village levels, which contains unique high-quality rural, pastoral #culture and natural resources. Let's have a #relaxing ride on the way！#VisitHangzhou"
  },
  {
    "id": 1752240235700961753,
    "content": "The 2024 Song Dynasty Cultural Fair kicked off at Hubin Pedestrian Street in #Hangzhou on Jan 27. This is an immersive Song Dynasty (960-1279) event that features floral boat cruises, dance performances, tea culture experiences and cultural handicrafts exhibitions."
  },
  {
    "id": 1849390381039067333,
    "content": "Do you know how popular #Hangzhou noodles are? The renowned Chinese actor Guo Tao recently shared his favorite undiscovered eatery in Hangzhou – Wangjiang Noodle Restaurant – on his social media. The most distinctive feature of Hangzhou #noodles is their large variety of toppings and sauces. Guo also highly recommends the restaurant's vegetarian chicken, which he believes has a very homemade taste. #TastyHangzhou"
  },
  {
    "id": 1903677763762188298,
    "content": "Good weather for a half #marathon! The 2025 Linping Half Marathon kicked off at E-fashion Town this morning. This year's event features 13 camera positions for #runners, with AI-generated marathon vlogs available post-race for participants to record their journey."
  },
  {
    "id": 1887413766729703439,
    "content": "Fun alert! The hit is coming to #Hangzhou on May 3-4! Debuting in 1975, it's one of the longest-running American musicals on #Broadway and in London's West End. Get ready for a totally unforgettable show! #WhatsOnHangzhou"
  },
  {
    "id": 1849798068155318720,
    "content": "By 2026, residents in #Hangzhou may be able to take the subway to yet another nearby city! The Hangzhou-Deqing intercity #railway is expected to be completed and operational by then. This new railway will connect with Metro Line 10 at Renhe North Station, and both lines will use modern Type A trains, with plans for seamless transit between the two routes. #HangzhouStories"
  },
  {
    "id": 1720377875436835248,
    "content": "There is an antique flea market every Saturday morning between 7:00 am and 12:00 pm at the #Hangzhou collectibles market. It sells stunning items like blue and white porcelain and exquisite jade jewelry, so don't miss out on this unique shopping experience! #VisitHangzhou"
  },
  {
    "id": 1891736537831965129,
    "content": "You've probably run into frequent showers lately since #RainWater, the second solar term of the traditional Chinese calendar, has arrived. As the Chinese saying goes, #spring rain is as precious as oil because it nourishes the parched soil. Join #Hangzhoufeel and ZCMU's \"Solar Terms and the Universe\" series to uncover more. #Hangzhou"
  },
  {
    "id": 1770731529699733777,
    "content": "The Xiyan Pavilion in #Hangzhou's Kengxi village is a hidden gem away from urban hustle and bustle. Whether you are a driver, cyclist, or hiker, it's the perfect spot to indulge in a moment of tranquility with panoramic views of villages and tea gardens from the mountaintop."
  },
  {
    "id": 1925546174565765439,
    "content": "On May 16th, Hangzhoufeel and the College of Foreign Languages of Zhejiang #University of Technology jointly launched a short-video themed #training activity. Three young directors and creators were invited to share their insights and experiences on #shortvideo creation in the context of international communication with over a hundred audience members."
  },
  {
    "id": 1764535213852598747,
    "content": "The Legoland #Shanghai Resort will open to the public next spring, featuring a theme park and a hotel with classic #LEGO elements. It will only take 1.5 hours to drive or 40 minutes by high-speed train to reach the resort from downtown #Hangzhou."
  },
  {
    "id": 1915712818487451933,
    "content": "On April 13, the \"Harmonious Countryside Music Season\" opened in Xinyu village, Yunhe sub-district, Linping district, #Hangzhou. The event featured a joint performance by the Berlin Girls Choir and a local youth orchestra. Through musical dialogue, intangible cultural heritage experiences, and interactive technology, young people also experienced one of China's ancient traditions — the art of silk production, giving them a deeper appreciation of the unique allure of China's intangible cultural heritage. #WhatsOnHangzhou"
  },
  {
    "id": 1925144550734999564,
    "content": "The first wave of West Lake's 2025 #lotus blossoms has emerged! Spotted at iconic spots like Autumn Moon over the Calm Lake, Hougushan, and Viewing Fish at Flower Pond, the flowers are a sure sign that #summer is near. #BeautifulHangzhou"
  },
  {
    "id": 1833490613649739799,
    "content": "On Sept 6, the #Hangzhou-Wenzhou high-speed railway officially began operating, while the \"no security recheck\" transfer channel between trains and the metro at Hangzhou West Station was launched the same day. Train passengers can now transfer to the metro without a second security check, making travel faster and smoother. #HangzhouStories"
  },
  {
    "id": 1801182104803581969,
    "content": "At the 2024 Beijing-Hangzhou Dialogue \"A Thousand-Mile Journey on a Thousand-Year #Canal\" Opening Ceremony, Zhao Yiqiang, the fourth-generation inheritor of the Beijing's Intangible Cultural Heritage \"Tongzhou canal ballads (Tongzhou haozi),\" performed a segment of the folk songs on site. #Beijing #Hangzhou #culture #grandcanal"
  },
  {
    "id": 1839661942413390139,
    "content": "On Sep 25, Wang Wenbin, Ambassador extraordinary and Plenipotentiary of the PRC, and Chhang Ra, Cambodian Minister of #Health, attended the ceremony of handing over 4 ambulances and some medical equipment to the Ministry of Health as a gift from the #Hangzhou-based Future Smile Charitable Foundation and other Chinese NGOs. Take this opportunity, they visited patients with cleft lip and palate and the Chinese medical volunteers who are carrying out the Cambodia- China #friendship #Surgery Mission from Sep 22-26, operating 50 people at #Cambodian Smile Center."
  },
  {
    "id": 1666411184709582849,
    "content": "The opening ceremony of the 2023 Grain in Ear Cultural Festival kicked off on June 6 in Yushan village, #Hangzhou's Fuyang district, where villagers and visitors gathered in the grain production area to celebrate the harvest season. #WhatsOnHangzhou"
  },
  {
    "id": 1878097965140852848,
    "content": "Dozens of foreigners joined Hangzhoufeel to explore the 16th #ChineseNewYear • New-Year-Goods Festival, where they bought new-year-goods, wrote the character of 福, as well as made and eat dumplings. An immersive experience of Chinese New Year celebrations! #Hangzhou #SpringFestival"
  },
  {
    "id": 1808802940637106193,
    "content": "\"My years as a student in Qiantang can be called the best golden years of my life,\" said Richard, the leader of the Uzbekistan football team at the Hangzhou #AsianGames, now back in Qiantang to finish his master's degree at #Hangzhou Dianzi University. #HangzhouExpats"
  },
  {
    "id": 1854116524883402753,
    "content": "A #rice field festival kicked off last weekend in Longma village, Lin'an district, #Hangzhou. People flocked to the golden rice fields and took part in a variety of activities, including the rice #harvest, a maze, fishing, a sports meet, long table banquets, and music shows. #WhatsOnHangzhou"
  },
  {
    "id": 1668866912565215233,
    "content": "The #Hangzhou #AsianGames Fun Run Series came to #Macao Special Administrative Region, with approximately 700 Macao students, young people, and athletes who are set to take part in the Games participating in the event held on June 11 in front of the Macau Science Museum Square."
  },
  {
    "id": 1840738372270338460,
    "content": "The #Hangzhou's Xiling Wulin Art Museum is now open! The 6th and 7th floors are home to the Xiling Seal Art Society Museum's new gallery, covering 11,000 sq m and featuring temperature-controlled exhibition spaces, halls, a seal carving library, and more. It's where culture meets modern art! #HangzhouStories"
  },
  {
    "id": 1736943885937774593,
    "content": "Don't miss out on the chance to participate in the International (#Hangzhou) #Trailwalk Conference, which will kick off on Dec 23 at Qianjiang Century Park with 15,000 participants expected. Join in and be a part of this exciting event!"
  },
  {
    "id": 1814314257829499279,
    "content": "We are in search of a tranquil resort in the villages surrounding #Hangzhou's Qiandao Lake, offering an escape the hustle and bustle of the city. Here, amidst lush green mountains and clear water, every breath is a precious gift from #nature. #VisitHangzhou"
  },
  {
    "id": 1646453176512700417,
    "content": "More than 20 outstanding enterprises from #Hangzhou in the field of #digital economy departed for #HongKong to participate in the 2023 Hong Kong International InnoEX to seek opportunities for cooperation in smart city, smart economy, smart environment and smart life."
  },
  {
    "id": 1789249095137480933,
    "content": "The 2024 Youth Theater Festival will be held from May 25 to 26 at Xixi Live in #Hangzhou. This year's festival will focus on young creators and explore the spirit of young people. Moreover, many activities will also be spread across multiple industrial parks in Binjiang."
  },
  {
    "id": 1833128225616306286,
    "content": "As of August, a total of 44 #Hangzhou listed companies in Zhejiang province have disclosed ESG reports, while another 37 have disclosed social responsibility reports or sustainable development reports. Environmental friendliness, rural vitalization, social services, employee growth and talent development are among the recuring themes in the reports. #HangzhouStories"
  },
  {
    "id": 1903038886957519325,
    "content": "Enjoying flowers before heading to the office became new morning routine for people who live in #Hangzhou! At 6:40 am, Taiziwan Park is already buzzing with visitors. With the soft morning sunlight casting a golden glow over the #tulips, every shot is picture-perfect. #BeautifulHangzhou"
  },
  {
    "id": 1914589841096167690,
    "content": "The DeepSeek, Deep Robotics, and Manycore Tech from #ZJU are shaping the industry globally, highlighting the innovative entrepreneurial education system and vibrant atmosphere on campus. How has ZJU transformed studious individuals into creative trailblazers? Watch the video for all the insights! #ZJUInnovation"
  },
  {
    "id": 1757283463944941880,
    "content": "Mr. Fahad Al Shamsi, the general secretary of the #JuJitsu Asian Union, states that the unity and brotherhood shown by the citizens of #Hangzhou and their support for all people in Asia contributed to the resounding success of the Hangzhou #AsianGames."
  },
  {
    "id": 1928081754075877401,
    "content": "Wu Zhiliang, the president of the Macao Federation of Cultural Circles, said at the Forum on Buiding up China’s Cultural Strength, that in the past two years, both \"Black Myth: Wu Kong\" and \"Ne Zha\" have demonstrated how new technologies have enables more connections with human nature. Now, AI technology can break down language and cultural barriers and promote the emotional connection among the people of Greater Bay Area."
  },
  {
    "id": 1892922226258977248,
    "content": "You can rent this \"ride\" for free and shop in comfort! Recently, the Nine Yifa Woman's Clothing Center in #Hangzhou launched a shared electric suitcase scooter program, allowing customers to shop while sitting and riding. [Photo/Jin Meng] #HangzhouStories"
  },
  {
    "id": 1879736241748643950,
    "content": "On Jan 10, the event of the 3rd BRLC New Year Concert & Marco Polo: 700 Years Later was staged in #Hangzhou. Over 600 guests enjoyed a feast of music cross borders, including the classical Chinese #music and the symphonies from Italy and other countries, while exchanging warm #NewYear's greetings."
  }
]