[
  {
    "id": 1760586858738884817,
    "content": "Shenzhen-based robotics company announced today that their industrial #humanoidrobot, #WalkerS, is now undergoing \"training\" at a factory of Chinese electric vehicle (EV) manufacturer . The training regimen involves tasks like adaptive walking for start-stop on the production line, robust mileage calculation, autonomous operation using perception and system data, and task scheduling. Check it out! #Robotics #TechTraining"
  },
  {
    "id": 1818827001752699069,
    "content": "#China's #PanZhanle set a new world record as he stormed to victory in the men's 100m freestyle at the #ParisOlympics on Wednesday. Pan touched the wall in 46.40 seconds, more than a second ahead of Australian Kyle Chalmers, who took silver. (Xinhua) #Swimming #ParisOlympics2024 #OlympicGames #GoChina"
  },
  {
    "id": 1727143595403354577,
    "content": "The highly anticipated Phase II extension of Shenzhen #Metro Line 8 is set to open Dec. 28, marking the city’s first direct Metro route to the popular Dameisha and Xiaomeisha beaches. The Phase II extension starts from the existing Yantian Road Station of Phase I, stretching eastward to Xiaomeisha Station, covering a distance of about 8.01 kilometers. It has four stations, namely Hong’anwei, Yantianxu, Dameisha, and Xiaomeisha. #subway #publictransport #shenzhen #travel"
  },
  {
    "id": 1793471531835875531,
    "content": "The highly anticipated 20th China (Shenzhen) International Cultural Industries Fair (#ICIF) will open today, featuring its main venue in Bao’an and 52 parallel subvenues across various districts. Among them, the subvenue at the Art Design Center in #LuohuDistrict stands out with its diverse exhibitions and workshops tailored for visitors and art enthusiasts alike. This year’s theme, “Artistic Life and Imagination,” brings together enterprises to host seven events, including exhibitions on original designs, digital media, and abstract art. The center also features a market selling various cultural and creative products and offers public workshops on the traditional craft of bamboo basket weaving. Don't miss out! #ICIF2024 #20thICIF #ICIF20Years #culture"
  },
  {
    "id": 1790207291494662427,
    "content": "A dazzling #drone & #fireworks showwas staged last week in #Marseille to celebrate the arrival of the Olympic flame! The show featured 800 #unmannedaerialvehicles (#UAVs) made by Shenzhen HighGreat Innovation Technology Development Co. Ltd. With a fleet of over 60,000 #drones, the company has presented thousands of drone performances in more than 300 cities around the globe. Its drones will continue to grace the sky above the iconic Palace of Versailles in #Paris with awe-inspiring aerial shows until the end of the #Olympics. #Paris2024"
  },
  {
    "id": 1772090698319450587,
    "content": "In an innovative leap for #logistics, the delivery time for local delicacies from #GuangmingDistrict to other districts has been halved by using #drone technology, Shenzhen Evening News reported. Fengyi Drones launched its low-altitude logistics route in the district Saturdaymarking a significant step forward in #Shenzhen's goal to establish a comprehensive #lowaltitude logistics network. Previously, it took 40 minutes to deliver Guangming pigeons, a beloved local delicacy, to residents’ hands by car. Now, the delivery time has been slashed to just 20 minutes. This service was showcased at the Fengyi Drone Operation Center in Bao’an District on Saturday. (Video: Shenzhen TV)"
  },
  {
    "id": 1820749036607209483,
    "content": "#Shenzhen's latest commercial hub, #MixCUniversiadeWorld, is making waves in Longgang. The complex is revolutionizing Shenzhen’s commercial landscape with a blend of architectural artistry and over 200 leading brands. Embracing a unique design, MixC Universiade World captures the essence of the Shenzhen Universiade Sports Center Stadium’s energy while incorporating elements of natural beauty. Its spacious layout offers residents a harmonious blend of #commerce and #nature, creating an environment that celebrates the beauty of the outdoors. To mark its grand opening, MixC Universiade World hosted a theme event, “Flow in the Nature,” featuring a captivating public art exhibition. Follow our photographer Lin Jianping to explore the new landmark!"
  },
  {
    "id": 1796862652775616654,
    "content": "Despite the heavy rain today, residents and car enthusiasts showed up in full force at the 28th GBA Auto Show today. The Shenzhen World Convention and Exhibition Center was buzzing with excitement and packed with eager attendees. #GBAAutoShow #Shenzhen #CarLovers"
  },
  {
    "id": 1696069511643099374,
    "content": "Starting from Aug. 30, incoming individuals to #China will not be required to undergo #COVID19 #nucleicacid or #antigen tests before entry, Foreign Ministry spokesperson Wang Wenbin said at a routine press conference today."
  },
  {
    "id": 1696722175309615463,
    "content": "Over 40 fresh faces from around the world at Peking University HSBC Business School () in #NanshanDistrict embarked on an #icebreaking tour Saturday to acquaint themselves with the city. The activity, organized by the Taoyuan Service Center for Expats (TYSCE), aimed to help the newcomers expand their social networks and adapt to their new life in #Shenzhen. #universities #collegelife"
  },
  {
    "id": 1793940323632398460,
    "content": "#KennethFok, Chairman of #HongKongArtsDevelopmentCouncil, speaks at the Sub-forum on Cultural Strength and Development Opportunities of the Greater Bay Area. #GBA #Shenzhen #HongKong #ICIF #ICIF2024"
  },
  {
    "id": 1799001088051569007,
    "content": "#JoshuaSZFinds Wherever you go in #Shenzhen, you're always close to a restaurant or #food stall. This city offers an abundance of food, making it a paradise for #foodlovers. Food often takes center stage in my #photography, as I love exploring new dining spots around the city. The food scene in Shenzhen is incredibly diverse, with restaurants from all over China showcasing their unique styles. Capturing these culinary experiences through photography is truly enjoyable. I especially love photographing local gem #restaurants where you can watch the food being prepared right in front of you. These establishments, often with years of history, have their own signature #dishes that keep customers returning. The bustling atmosphere, with waiters and diners moving around, adds to the charm. As the saying goes, the busier the place looks, the better the food is likely to be! Ins: heysupjosh X: Facebook: Joshua Fernandez"
  },
  {
    "id": 1806948170926321800,
    "content": "The third regatta of the spring season of the Shenzhen X9 Alliance of Universities and Institutes (#X9Alliance) kicked off at the Dasha River Ecological Corridor in Nanshan District this morning. As the final event of the third #rowing league’s spring season, this competition has seen the largest number of participants and the widest range of contestants since the league began, with special invitations extended to #OxfordUniversity and #CambridgeUniversity to compete alongside domestic #universities and institutions."
  },
  {
    "id": 1848558072668537136,
    "content": "Get ready for takeoff! The inaugural \"Aerial F1\" Drone Super League (Longgang) has officially begun in Longgang District. Over 260 top #drone pilots from across #China are battling it out for the title of Longgang's low-altitude speed king. From traditional racing to innovative challenges like drone football, there's something for everyone. Even young pilots as young as 9 are joining the fun! Mark your calendar and don't miss a moment of this exciting week-long event! #drones #DroneRacing #Shenzhen #TechSports"
  },
  {
    "id": 1649351487913328642,
    "content": "The 2020 national population census found that the average age for a Chinese person to get married for the first time was 28.67 years, in contrast to 24.89 years back in 2010. Some young people share their stories about #love and #marriage in this article."
  },
  {
    "id": 1743614055527395599,
    "content": "In #Shenzhen, folks aren't just out walking real #dogs; they're also taking a stroll with ROBOT DOGS! Take a look at this adorable sighting, which drew paws-itive attention from passersby at MixC World in Nanshan today. #robot #robotdogs #pets #TechNews"
  },
  {
    "id": 1813400229749911877,
    "content": "Exciting news! A multifunctional smart terminal was launched at Metro Line 4’s Shenzhen North Station on Monday. This innovative terminal offers intelligent AI voice inquiries, digital interaction, ticketing, information access, and remote customer service. As Shenzhen's largest railway hub and an interchange for Metro lines 4, 5, and 6, the station sees hundreds of thousands of commuters and travelers daily. HKMTR Shenzhen Co. has introduced this smart terminal to enhance the travel experience for all passengers. Equipped with AI visual recognition and positioning technology, it works seamlessly with the MTR (Shenzhen) live+ mobile app, offering AR panoramic views and VR navigation services. A first in the domestic rail transport sector! #Shenzhen #SmartCity #Metro #Innovation #TechNews"
  },
  {
    "id": 1917402988160901149,
    "content": "After a great success in #Moscow, #Shenzhen original #dancedrama \"#WingChun\" continues its captivating tour in #Russia and is set to be staged at the historic #MarinskyTheater in St. Petersburg from April 30 to May 1. At the world-famous #BorisEifmanDanceAcademy, one of Russia's most prestigious #dance institutions that is located at the heart of St. Petersburg, Shenzhen Daily had an exclusive talk with Mr. #KonstantinMatveev, the artistic director of Boris Eifman Dance Academy, who shared his insights into this remarkable artistic and #culturalexchange. Click in the video to take a listen!"
  },
  {
    "id": 1814116291395150137,
    "content": "The third plenary session of the 20th Communist Party of China Central Committee has ushered in a wave of new opportunities and confidence for foreign-funded enterprises operating within the country, according to #KlausZenkel, vice president of the EU Chamber of Commerce in China (EUCCC) and Chairman of the European Chamber South China Chapter. The 20th Central Committee of the CPC passed a pivotal resolution aimed at comprehensively deepening reform to propel Chinese modernization forward during the session, which spanned from Monday to Thursday. Zenkel highlighted the Chinese Government’s commitment to opening up, which stands to benefit foreign investors through increased convenience for foreign investments and the assurance of equal treatment. #DeepeningReform #3rdplenum"
  },
  {
    "id": 1805064356637667588,
    "content": "On June 22, the #InternationalCittaslowOrganization () has officially bestowed the title of \"#InternationalSlowCity\" upon Nan'ao Subdistrict in Dapeng New Area, making #Shenzhen the first first-tier city and the first in the Guangdong-Hong Kong-Macao #GreaterBayArea to receive this recognition. The concept of #SlowCities originated in 1986 with the \"Slow Food Movement\" spearheaded by renowned Italian journalist Carlo Petrini. It advocates for a novel urban development model that harmoniously integrates modern technology with traditional lifestyles, fostering a more balanced and sustainable approach to living within bustling cities. Situated on the southern coast of the Dapeng Peninsula, Nan'ao boasts an exceptional ecological foundation, with a remarkable forest coverage rate of 87%. Its air quality consistently ranks as the best in Shenzhen, earning it the distinction of being the city's first \"Zero Industrial Zone\" and a rare \"Natural Oxygen Bar\" in a major metropolis. Additionally, Nan'ao is renowned for its longevity among its residents."
  },
  {
    "id": 1750707616769269803,
    "content": "The 2024 #SpringFestival travel rush officially kicked off today, which will last for 40 days. Passengers can also start buying train tickets for #ChineseNewYear's Eve. According to the Ministry of Transport, it is estimated that there will be about 9 billion passenger trips during this year's Spring Festival, which could set a record high. #travel"
  },
  {
    "id": 1753240255719997934,
    "content": "#InDepth Long queues were seen at #ShenzhenUniversity’s (SZU’s) campus canteen last month where teachers and students waited to try a free “AI chicken soup” cooked with black silkie chickens that were gifted by thankful Guizhou farmers. A dozen students from SZU’s #TencentCloud and AI Class developed an #AI-based #farming system for black silkie chickens last year. The Tencent Cloud-based system took eight months of designing and testing before it was launched at a chicken farm in Chishui, Guizhou Province."
  },
  {
    "id": 1851169650840912031,
    "content": "Did you know #Shenzhen is #China's most convenient city for #commuters? The recently released 2024 Major Chinese Cities Commuting Monitoring Report shows 81% of people can reach work in under 45 minutes! The report analyzed data from 45 major cities in China. Seven megacities were included — #Beijing, #Shanghai, #Guangzhou, Shenzhen, #Tianjin, #Chongqing, and #Chengdu. Shenzhen’s convenient commute is a result of the city’s efficient, convenient, and intelligent integrated #transportation system and its extensive #publictransport network, the report said. #Commuting #SmartCity How long is your daily commute?"
  },
  {
    "id": 1793531660258128188,
    "content": "How cool! A 1:1 model of the J-20 fighter jet has arrived at Shenzhen University! On May 20, this impressive model appeared on the lawn in front of Zhiyuan Gate in the southern area of Shenzhen University's Yuehai Campus, capturing the attention of many students and faculty. Today, the jet model will be transported to Lihu Campus, where the event will continue from May 24 to 26. #ShenzhenUniversity #J20 #FighterJet (: Xiaohongshu account of Shenzhen University)"
  },
  {
    "id": 1797458362969567484,
    "content": "The banks of Houhai River in #Shekou were buzzing with excitement by 7:30 a.m. yesterday, long before the 4th Houhai River #DragonBoatRacekicked off! Despite facing tough competitors right from the start, last year's champions, The Globe Trotters, clinched a spot in the finals! It wasn't all smooth sailing though—during a sharp turn, their boat tipped, sending some team members splashing into the water! Jorieke from the Netherlands, a veteran racer with the Globe Trotters and a #Shenzhen resident for seven years, shared her enthusiasm: \"I do have high expectations here!\" The race has been organized by Shekou Subdistrict Office to celebrate the traditional #DragonBoatFestival, which is observed on the fifth day of the fifth month on the Chinese lunar calendar. It will fall on June 8 this year. #tradition #ChineseFestivals #shenzhen #China"
  },
  {
    "id": 1627856893724213254,
    "content": "A total of 122 cases and 1,331 pieces/sets of works covering #finearts, #art, #science, #technology and other fields are on display in #Shenzhen, as the Fourth China Design Exhibition & Public Art Thematic Exhibition opened yesterday. #exhibitions #design"
  },
  {
    "id": 1748178173312053505,
    "content": "On Jan. 17, announced a groundbreaking partnership with for an integrated in-car #drone. This innovative drone features automotive-grade storage, automatic battery swapping, and high-definition imaging. Seamlessly integrating with BYD's #ElectricVehicles, it utilizes advanced navigation, sensors, and intelligent control for autonomous functions like takeoff, landing, cruise, and obstacle avoidance. With a 50 billion yuan ($7.4 billion) investment, the project will unfold over the next few years, leveraging #BYD's automotive and battery expertise alongside #DJI's drone technology for future travel needs. #drones #Innovation #shenzhen"
  },
  {
    "id": 1667761896722956289,
    "content": "At a ceremony marking the launch of the #EyeShenzhen #multilingual #website held in Futian yesterday, , one of the Shenzhen Global Communication Ambassadors appointed at the ceremony, shared with the audience his story with EyeShenzhen over the past eight years."
  },
  {
    "id": 1709833961395073046,
    "content": "He Jie claimed #China's first men's #marathon title at the #HangzhouAsianGames today. He clocked in at two hours 13 minutes and two seconds to claim the historic victory. DPR Korea's Han Il Ryong finished 2:13:27 to grab silver and China's Yang Shaohui took bronze with 2:13:39."
  },
  {
    "id": 1627502140586614785,
    "content": "The Chinese University of Hong Kong,Shenzhen () has currently entered into cooperation with some 132 prominent overseas schools, marking its progress in going global,sources from the school said at the Spring Reception for Media 2023 held Saturday."
  },
  {
    "id": 1669180636329025537,
    "content": "Tens of thousands of #lotus flowers, or #waterlilies, are in full bloom in Honghu Park, the main venue of the #Shenzhen lotus flower show, bringing #summer vibes to the city. The #33rdShenzhenLotusShow kicked off today and will last through June 30."
  },
  {
    "id": 1849356049612263499,
    "content": "Lifestyle retailer #MINISO has delighted #HarryPotter fans with the introduction of its exclusive Harry Potter collection, igniting excitement among Potterheads globally. In #Shenzhen, a MINISO x Harry Potter pop-up was unveiled at COCO Park in Futian District on Saturday, drawing large crowds of fans eager to be the first to immerse themselves in these unique items. Running until Nov. 17, the pop-up offers an engaging, interactive #shopping experience showcasing exclusive merchandise that encapsulates the essence of beloved Harry Potter characters and moments. In addition to the unique shopping experience, visitors are treated to in-store activities and special gifts, enhancing the excitement and fostering a truly enchanting atmosphere. Don’t miss out — come and immerse yourself in the magic!"
  },
  {
    "id": 1831518788027871233,
    "content": "#Shenzhen #dancedrama \"#WingChun,\" which seamlessly blends #martialarts with #dance, has earned the admiration of #British spectators for its unique artistic style and cultural depth since its debut at the Sadler’s Wells Theatre in London on Aug. 30 local time. The captivating performances have attracted many theatergoers, who have expressed desire to visit Shenzhen and experience the city firsthand."
  },
  {
    "id": 1805081168938946985,
    "content": "Two Chinese #scientists, Li Deren and Xue Qikun, won #China's top #scienceaward on Monday for their contributions to the country's #science and #technology development, Xinhua News Agency reported today. Xue, president of the Shenzhen-based , is a renowned experimental #physicist in the field of condensed matter #physics with international acclaim. He led the team to observe the quantum anomalous Hall effect in experiments for the first time. His team also discovered high-temperature superconductivity, pioneering a new research direction in high-temperature superconductivity internationally."
  },
  {
    "id": 1666029316436787202,
    "content": "#ICIF2023 Follow our reporter to take a sneak peak inside the Shenzhen World Exhibition & Convention Center, where the #19thICIF will kick off tomorrow and run through June 11. Everyone's busy making finishing touches on displays! So excited! Can't wait#culture #shenzhen"
  },
  {
    "id": 1815566260861813073,
    "content": "A new residential #property development in #Shenzhen created a sensation Sunday when all 116 of its apartments were sold less than three hours after being listed for presale. The Haideyuan A estate, located in the Antuoshan area, Futian District, became the first residential project in the city to achieve such a remarkable feat since the beginning of this year. The average price of the 116 apartments was 128,500 yuan per square meter. The smallest apartment has an area of 87 square meters and sold for 11.24 million yuan (US$1.5 million), while the biggest is 450 square meters and sold for 59.98 million yuan. #realestatemarket"
  },
  {
    "id": 1732694817384316942,
    "content": "#China and #Singapore today announced that they will establish a 30-day mutual #visa exemption agreement between both countries. The proposal was announced during the 19th Joint Council for Bilateral Cooperation (JCBC) meeting – the highest-level annual bilateral forum between both countries. This is the first JCBC meeting to be co-chaired by Singapore’s Deputy Prime Minister Lawrence Wong and Chinese Vice Premier Ding Xuexiang. Lawrence Wong said that the #visafree arrangement would “provide greater convenience for people-to-people exchanges,\" adding that \"We hope to surpass pre-epidemic levels on direct flights, which can facilitate more people-to-people exchanges,\" he said."
  },
  {
    "id": 1833327635574989244,
    "content": "Happy Teachers’ Day to all the incredible #educators in #China! Your dedication and hard work shape the future of countless students. Thank you for everything you do. To celebrate this special occasion, here we present the takeaways of four #expat teachers currently working in #Shenzhen. #TeachersDay Click the link to learn their stories:"
  },
  {
    "id": 1717733100170715627,
    "content": "#Shenzhen announced the start of construction of the second batch of 20 #internationalblocks at a ceremony in Bao’an District yesterday. The 20 international blocks are scattered in nine districts and #Dapeng New Area. Among them, #Huaqiangbei, #Pingshan and #Meisha blocks, which were among the city’s first batch of international blocks, found their names in the second batch again."
  },
  {
    "id": 1921747843104317692,
    "content": "An array of cutting-edge #technologies and products from 60 #Shenzhen-based #enterprises, along with #intangibleculturalheritage items and the original Shenzhen-produced #dancedrama “#WingChun,” will be presented during the “#ShenzhenWeek” event, which opens today at the #ChinaPavilion of #Expo2025 Osaka. Over three days, Shenzhen’s 165-square-meter hall at the China Pavilion will showcase its technological strengths, #innovation capacity, and livable, business-friendly environment. Themed “A Day in a Future Shenzhen Community,” these exhibits will immerse visitors in green energy, smart living, intelligent health care, and innovative connectivity. #EXPO2025 #expo2025osaka #EXPO2025大阪関西万博"
  },
  {
    "id": 1860277290388885592,
    "content": "#JoshuaSZFinds While much of the news about #China over the past decade has focused on high-speed rail projects, an often-overlooked market is the #bicycle and #ebike industry, which has taken every Chinese city by storm. #Shenzhen, a densely populated city of millions, faces its own set of challenges in providing efficient and convenient #commuting options for everyone. For many residents of Shenzhen, bicycles and e-bikes are the most reliable forms of #transportation. And for those who don’t own a bike, renting one is both simple and accessible. In my ongoing series, I dedicate time to photographing #cyclists and e-bike riders in the heart of Shenzhen. I document the creative ways locals navigate this sprawling city. The transportation choices people make often shape the evolution of public infrastructure. For photographers like me, capturing this transformation is part of the excitement! #photography #photographers #expats #citywalk #cityscape Ins: heysupjosh X: Facebook: Joshua Fernandez"
  },
  {
    "id": 1867476768640446829,
    "content": "#Foreigners working in #Shenzhen can now enjoy more convenient services as the city has integrated their #workpermits with #socialsecurity cards, according to the city's foreign experts bureau. Starting this month, the work permit information of foreigners will be embedded into their social security cards, allowing them to use both physical and digital cards for various services related to their work and life in #China. With the social security card, foreigners can now enjoy a wider range of services, including financial transactions, healthcare, transportation, and tourism. Foreigners who have already obtained a physical work permit can continue using it until it needs to be renewed or modified, at which point they will follow the new procedures for card integration. For more details and FAQs, please visit the Shenzhen Foreign Experts Bureau website:"
  },
  {
    "id": 1881529847165677670,
    "content": "#Shenzhen has once again expanded its network of #parks, according to the city's Urban Management and Comprehensive Law Enforcement Bureau. In 2024, the city added 35 new or upgraded parks, bringing the total number of parks to 1,320. At the current rate of visiting one park per day, it would take approximately 3.6 years to explore all of the city’s parks."
  },
  {
    "id": 1861605067041972353,
    "content": "Experience the future of transportation at Lianhua Hill Park in Futian District! From now until Dec. 31, residents can take a free ride in a driverless #sightseeing car. These innovative #minibuses are equipped with advanced sensors and can navigate the park safely and efficiently. It's a 6-passenger, L4-level #autonomousvehicle designed as a mobile space. Unlike traditional cars, it has no front or rear and lacks conventional controls like steering wheels and pedals. Don't miss out on this unique opportunity! #driverlesscars #transportation #parks #shenzhen"
  },
  {
    "id": 1754327369064792435,
    "content": "For people in #GuangdongProvince, no #SpringFestival is complete without visiting at least one #flower fair. The #2024ShenzhenSpringFestivalFlowerFair is being held until Feb. 9, which is #ChineseNewYear’s Eve. All city districts, the Dapeng New Area and the Shenshan Special Cooperation Zone have each set up a flower fair this year. They are collectively referred to as 2024 Shenzhen Spring Festival Flower Fair. There are nearly 300 shopping spots with nearly 4,300 stalls across the city that allow citizens to buy #flowers and decorations for the upcoming Chinese New Year. #Guangdong Click the link to learn more:"
  },
  {
    "id": 1803632725565563204,
    "content": "#Huawei Technologies’ #mobile platform #HarmonyOS has achieved a major milestone, overtaking Apple’s #iOS to become the second most popular mobile operating system in the #Chinese market, according to a recent report by research firm #Counterpoint. #China #Shenzhen #life #mobilephone #fun #relax #leisure #tech #technology"
  },
  {
    "id": 1796381517218001361,
    "content": "Exciting news from #NeilingdingIsland! The Guangdong Neilingding Futian National Nature Reserve has welcomed 10 adorable baby #macaques since May, helping to grow the wild macaque family right here in #Shenzhen. The island patrol team has been overjoyed to watch these tiny, curious newcomers explore their world, thriving under the watchful eyes of their mothers. #wildlife #NeilingdingIsland #WildlifeConservation #BabyMacaques"
  },
  {
    "id": 1914970611832770797,
    "content": "Visitors, friends & #ShenzhenGlobalCommunicationAmbassadors, we invite you to share #Shenzhen's must-visit spots! Share your favorite Shenzhen spots with photos/videos & a personal recommendation to us via email! Entries will have the chance to win our prizes! Please check out the poster below for more details!"
  },
  {
    "id": 1696433061150474729,
    "content": "Dongpo Pork, Sister Song's Fish Broth, Scallion-Scented Ribs, Stir-fried Beef with Leeks... The athlete's menu at the #HangzhouAsianGamesVillage is now released. Which one do you prefer? The will kick off in #Hangzhou on Sept. 23. Can't wait! #food #foodies #cuisine #Chinesecuisine"
  },
  {
    "id": 1679310585622822912,
    "content": "The 2023 Shenzhen (International) Urban Environment and Landscape Industrial Exhibition is showcasing a wide range of smart #urbanmanagement solutions such as smart street lamps, smart street benches &smart trash bins, among others. #smartcities #shenzhen"
  },
  {
    "id": 1692357277322498240,
    "content": "Cross-border bus services from Futian Bus Station to #HongKong are back, starting Aug. 15. Enjoy hassle-free trips to #HongKongInternationalAirport and the magical #HongKongDisneyland. The Hong Kong airport business line, Tsim Sha Tsui (TST) line, and Hong Kong Disneyland tourism line are up and running again. Travelers can grab the tickets via the WeChat account \"广东联网售票.\""
  },
  {
    "id": 1683503642249400320,
    "content": "The #ChinaBasketballAssociation (#CBA) has confirmed that #NBA star #KyleAnderson has been granted Chinese nationality. Anderson’s great-grandpa is a SZ native. In 2018, Anderson and his mother reunited with his Chinese family. The story from 2018:"
  },
  {
    "id": 1876172585618293024,
    "content": "Exciting news! A new overnight high-speed train service between #Shenzhen and #Chengdu is now available! The D962 train departs from #Shanwei at 7:28 p.m. and arrives at Shenzhen North Railway Station at 8:40 p.m. After an overnight journey, the train is scheduled to reach Chengdu East Railway Station at 7:44 a.m. and #Guangyuan Railway Station at 9:38 a.m. the following day. The total travel time is 14 hours and 10 minutes, with the Shenzhen-Chengdu segment taking 11 hours and four minutes. The train operates on Thursdays, Fridays, Saturdays, and Sundays. According to the 12306 ticketing platform, the fare for a second-class seat on the return D961 train from Chengdu East to Shenzhen North is 552 yuan. A sleeper berth on the upper bunk costs 950 yuan, while a lower bunk is priced at 1,070 yuan. Standing tickets are available for 552 yuan."
  },
  {
    "id": 1622780105146896384,
    "content": "Huanggang Checkpoint, the only 24-hour land checkpoint between #Shenzhen and #HongKong, resumed border-crossing services for travelers yesterday. \"I am excited and made a trip for a night snack in Shenzhen,” a woman surnamed Liu told reporters."
  },
  {
    "id": 1881635841292075465,
    "content": "#Shenzhen's first #underseatunnel opened today! The #MaWanUnderseaTunnel, which is also the largest of its kind in China, officially opened this morning. The project, which began construction in July 2019, is located in the #Qianhai area, a key engine of the Guangdong-Hong Kong-Macao #GreaterBayArea. The #tunnel stretches approximately 8.05 kilometers. It consists of both underground and above-ground sections. The underground portion is a six-lane, bi-directional urban expressway with a designed speed of 80km/h. The above-ground section is a six-lane, bi-directional urban arterial road with a designed speed of 40km/h. The Ma Wan Undersea Tunnel features two underwater tunnel sections, each with a maximum excavation diameter of 15.5 meters, making it the largest underwater tunnel in China."
  },
  {
    "id": 1826450413119570019,
    "content": "Since their launch in August 2020, Sino-European train services have transported over 474,000 tons of goods valued at 16.1 billion yuan (US$2.26 billion) to #Europe. Operating on 19 routes connecting #Shenzhen with 44 countries, these #trains have become a vital link in the international #supplychain. Over 100 types of products from the Guangdong-Hong Kong-Macao #GreaterBayArea, including #electronics, #machinery, and #consumergoods, now reach European markets efficiently via these trains. Customs data shows that export values have grown by over 20% annually, highlighting the logistics corridor's robust performance."
  },
  {
    "id": 1821386953495076889,
    "content": "Drama lovers, get ready! The #PingshanDramaCarnival is OFFICIALLY OPEN!The event kicks off the grand opening of the stunning #ChangshouDramaville in #PingshanDistrict. For the next 12 days, residents will have the opportunity to enjoy 31 activities and 28 plays, including “I Love Peach Blossom” and “The Shawshank Redemption,” at Changshou Dramaville and Pingshan Theater. Don’t miss out on this cultural extravaganza! #shenzhen #culture #art #theater Click the link to learn more:"
  },
  {
    "id": 1722790697936502938,
    "content": "Starting today, #flower lovers can immerse themselves in a sea of #bougainvilleas at Lianhua Hill Park in Futian District, the main venue of the #2023ShenzhenBougainvilleaShow. The annual Shenzhen Bougainvillea Show, which was first held in the city in 1999, also set up a subvenue at the Bougainvillea Valley Park in Bao’an District this year. The show will run through Nov. 19."
  },
  {
    "id": 1892761935625802021,
    "content": "#Shenzhen welcomed a record 2.76 million #foreignvisitors in 2024, a 100% increase from the previous year, Shenzhen Economic Daily reported. This surge in foreign arrivals places Shenzhen second among Chinese cities. The city also saw a significant increase in non-cash #transactions by foreign visitors, with a total of 146 million transactions worth 19.887 billion yuan. This represents a 62% and 78% increase respectively over the previous year, surpassing the national average. Visitors from #HongKong accounted for a substantial portion of these transactions, with 104 million transactions worth 12.273 billion yuan. #SouthKorea, the #UnitedStates, and #Russia were the top three countries of origin for foreign visitors to Shenzhen, accounting for 14%, 10%, and 8% of total spending, respectively. #Singapore and #Malaysia followed closely behind, with 7% and 6% of spending, respectively. #travel #ChinaTravel #tourism #economy"
  },
  {
    "id": 1846014929285054863,
    "content": "The #2024ShenzhenLonghuaOpen is underway! The tournament, co-hosted by the Chinese Tennis Association and the Longhua District Government, kicked off yesterday in #LonghuaDistrict. Running through Oct. 20 at the Mission Hills Ecological Sports Park (观澜湖生态运动公社网球场), the event has attracted top #tennis players from 22 countries and regions. Notable participants include several #ATP top 100 players, such as France’s Arthur Cazaux, Australia’s Adam Walton, America’s Mackenzie McDonald and Zachary Svajda, and China’s Bai Yan, Sun Fajing, Cui Jie, and Mo Yecong. This year, the tournament boasts a prize pool of US$133,250, with the winners earning 100 ATP points, according to the organizing committee. #sports #shenzhen"
  },
  {
    "id": 1699244663096647927,
    "content": "A total of 1,580 new energy vehicles (#NEVs) manufactured in #China were recently loaded at Xiaomo International Logistics Port in Shenshan Special Cooperation Zone for shipment to #Thailand. The vessel will reach Thailand in seven days, marking a new record for NEV exports since the port’s commencement of operations. To date, a total of 6,130 #vehicles have been exported from the Xiaomo port. #shipment #ElectricVehicles #shenzhen"
  },
  {
    "id": 1760131900122030436,
    "content": "Andrea Myles, senior trade and investment commissioner at the Australian Trade and Investment Commission () and Australian deputy consul-general in Guangzhou, was optimistic about enhanced business collaborations between #Australia and #China in 2024. She also highlighted the potential for further cooperation with #Shenzhen. “The economic ties between Australia and China are underpinned by strong economic complementarity and there is great potential for deepening bilateral cooperation,” Myles told Shenzhen Daily during a recent interview."
  },
  {
    "id": 1869206128485380372,
    "content": "A 26-year-old man has become #Shenzhen’s 800th person, and the country’s 19,098th, to donate hematopoietic stem cells (#HSCs) to an unrelated recipient. The peripheral blood stem cell collection took place at the University of Hong Kong-Shenzhen Hospital yesterday. The collected HSCs arrived at the recipient’s hospital in Guangzhou the same day for transplantation."
  },
  {
    "id": 1810512905361846531,
    "content": "Set sail from Shekou and witness the stunning night view of #ShenzhenZhongshanLink on the GBA #cruise! This new mega-bridge is a marvel of engineering and a must-see for visitors! Check out what visitors have to say about the night sightseeing experience! #Shenzhen #Zhongshan #Infrastructure #GBA"
  },
  {
    "id": 1710934598488936663,
    "content": "#TeamChina bagged a total of 383 medals, including 201 gold, 111 silverand 71 bronze, ranking first in the medal tally during the #19thAsianGames, which concluded competitions on Sunday. The 19th #AsianGames, which featured 40 sports, 61 disciplines, and 481 events, ran from Sept. 23 to Oct. 8 in #Hangzhou, along with five co-host cities, namely #Ningbo, #Wenzhou, #Huzhou, #Shaoxing, and #Jinhua, in east China's #ZhejiangProvince."
  },
  {
    "id": 1910613267996959164,
    "content": "#JoshuaSZFinds This week, I gathered photos I’ve taken over the years of various malls and #shopping centers around #Shenzhen. If you’re new to the city, you’ll probably be amazed by the sheer number of places to shop — both indoors and outdoors. And if you’ve lived here for a while, #shoppingmalls might feel as common as a neighborhood coffee shop! #Supermarkets and food stalls are also never far, no matter where you live. These shopping areas are great spots to capture everyday life in Shenzhen. Whether it’s families enjoying hot pot, couples browsing for a new wardrobe, or old friends catching up over coffee, these spaces hold a strong sense of #community. Personally, I also admire the #design of these spaces and how they adapt to the needs of the local #neighborhoods. Through my photos, I try to tell these stories and show how these places reflect the rhythm of life in Shenzhen. #expats #UGC #photography #photographers #urbanlife #China Ins: heysupjosh X: Facebook: Joshua Fernandez"
  },
  {
    "id": 1772911260272894041,
    "content": "#InDepth #Shenzhen's pivotal role in shaping the future of the #newenergyvehicle (#NEV) industry in #China has been further solidified. Data show the city produced 1.78 million #NEVs last year, accounting for nearly 20% of the national total. This statistic underscores Shenzhen’s manufacturing prowess. Projections suggest that NEV production in Shenzhen will surpass the 2 million mark by 2025, with the industry’s output expected to hit a staggering 1 trillion yuan (US$138 billion). The city’s dominance extends to the charging pile sector, as it holds over half of the country’s market share for charging station equipment. #ElectricVehicles"
  },
  {
    "id": 1707703002784780401,
    "content": "On the occasion of the #MidAutumnFestival that celebrates reunion, Zhang Zhongliang, head of the #Shenzhen literature and art delegation and the vice president of the Shenzhen International Cultural Exchanges Association, visited the cast of \"#WingChun\" in #Singapore, congratulating on the success of the performances and extending holiday greetings."
  },
  {
    "id": 1699974498332840210,
    "content": "Covering an exhibition area of 7,500 square meters with over 10,000 #exhibits, the 2023 Guangdong-Hong Kong-Macao Greater Bay Area Arts and Crafts Expo and the 13th Shenzhen Arts and Crafts Expo opened to the public yesterday. The four-day #expo, held at Hall 7 of the Shenzhen Convention and Exhibition Center in Futian District, centers on inheritance and innovation and has set up four main exhibition areas. #arts #crafts #shenzhen"
  },
  {
    "id": 1844271550880677928,
    "content": "#InDepth This year #Shenzhen has launched a series of trade-in policies to encourage #consumers to upgrade their old appliances, cars, and other goods for new ones. This program offers #subsidies and #taxbreaks, making it cheaper for consumers to buy new products. The policy has been a success, boosting consumer spending across various sectors. For example, during the Mid-Autumn Festival holiday, the number of consumers purchasing home appliances through trade-ins reached 30,000 daily, with sales revenue nearing 200 million yuan. The trade-in model benefits both consumers and the #economy. Consumers get to upgrade their goods at a discount, while the economy gets a boost from increased #spending. The policy also encourages the purchase of greener and more energy-efficient products. Read more:"
  },
  {
    "id": 1748333179805761924,
    "content": "If you are a photographer like me, this is a must-see location of Shenzhen. If you are not much of a hiker, you can also take a boat around to the pier just below the highest point, from there are stairs you can climb to the more accessible spot to take your photos. While Shenzhen is a city that has developed at lightning speed, it's great to have access to beautiful natural locations just outside the city perfect for a day trip. #travel #hiking #NaturePhotography"
  },
  {
    "id": 1797824977024270564,
    "content": "#China's Chang'e 6 mission has completed the most important part of its #lunar adventure as its sample-loaded ascender lifted off from the #moon's far side on Tuesday morning. According to the China National Space Administration, the ascender, one of the four major components of the Chang'e 6 robotic probe, started its ascent engine at 7:38 am and flew nearly 6 minutes before reaching a lunar orbit. The mission has collected #lunarsamples in the past two days, and they are sealed inside a container on the ascender. (Source: China Daily)"
  },
  {
    "id": 1767008667923370222,
    "content": "The #ShenzhenMetro network recorded 10.25 million passenger trips Friday, surpassing the previous single-day record of 10.17 million set on Dec. 31. On Friday, the passenger intensity of the #Metro network reached 18,400 passenger trips per kilometer, ranking it the busiest Metro network in #China. The 16 lines (including trams) operated by Shenzhen Metro Group witnessed a combined total of 9.45 million passenger trips. Notably, Line 5 handled 1.44 million passenger trips, followed by Line 10 with 571,000 trips, Line 12 with 537,000 trips, and Line 14 wth 558,000 trips."
  },
  {
    "id": 1896753371253747919,
    "content": "#Shenzhen released four action plans March 3, outlining the city's development in #ArtificialInteligence, including #AI-powered terminals, embodied intelligent #robots, and the growth of gazelle and unicorn companies, Shenzhen Special Zone Daily reported yesterday. The \"Shenzhen Action Plan to Accelerate the Development of a Pioneering Artificial Intelligence City (2025-2026)\" provides a comprehensive overview of the city's AI development for the next two years. By 2026, the city aims to have more than 3,000 AI enterprises, over 10 unicorn companies, an average annual growth rate of over 20% in the AI industry, and the establishment of more than 10 innovative incubators for AI and embodied intelligent robots. The plan also aims to create an environment characterized by open application scenarios, accessible computing power, a robust industrial ecosystem, and convenient #innovation and #entrepreneurship."
  },
  {
    "id": 1802535641118658713,
    "content": "Residents of Longhua District, both local and #international, participated in a #BritishDay #event yesterday. The event includes a fun fact-sharing session led by the headmaster of #MerchistonInternationalSchoolShenzhen, #traditional #Britishhat crafting, #HarryPotter wands making, and #afternoontea savoring. #China #life #funfact #Shenzhen #craft #UK #British #Britain #fun #relax #leisure #food #foodie #hat #children #kids #interact #Shenzhen"
  },
  {
    "id": 1760483610749272573,
    "content": "The city’s first #jobfair after the Spring Festival holiday was held in Longgang District yesterday, ushering in the Spring Breeze job fair season that will see more than 300 job fairs to be held until April. The fair attracted 61 enterprises including AMTC, a manufacturer of liquid crystal display TVs, and BYD. They provided 6,000 vacancies of 500 posts in a dozen of industries like electronic information, digital economy, smart manufacturing and new energy. #jobseekers #Employment"
  },
  {
    "id": 1714186064532000882,
    "content": "#Shenzhen is taking impressive steps to make its urban landscape more bird-friendly. #Tencent, a prominent tech giant in the city, has taken a pioneering role in tackling the pressing issue of #birdcollisions. In a commendable move, the company has pasted wave-point stickers to the glass exterior of its Binhai Building in Nanshan District. The initiative serves to prevent #birds from accidentally colliding with the building."
  },
  {
    "id": 1731209309516865552,
    "content": "During the opening ceremony of the 5th #WorldMediaSummit in #Guangzhou today, Toru Mizutani, president and editor-in-chief of #KyodoNews, expressed his astonishment at his first visit to Guangzhou, symbolizing the rapid development of the #Chinese economy. He noted the widespread presence of smartphones and #electriccars, observing that the extent of digitization in daily life surpassed his expectations. He stated that in the near future, China will usher in an era of electric cars equipped with autonomous driving and #smartphone capabilities, thereby fostering a mobile #travel society."
  },
  {
    "id": 1716724972713091235,
    "content": "#ExpatsInShenzhen The fast development of #ArtificialInteligence (#AI) platforms has significantly changed people’s daily lives, especially for some groups working in particular fields. Haris Memic, an #interiordesigner and #architect, is one of them. The #Montenegrin's decision to settle in #Shenzhen was driven by the city’s reputation as a vibrant hub of #innovation and #creativity. #expats #interiordesign"
  },
  {
    "id": 1735485355036696682,
    "content": "Winners of the 5th #ExpatsEyeShenzhenPhotoContest have been unveiled. This year’s contest was held from July 20 to Sept. 15, and was divided into #humanistic and #nature categories. The organizing committee has received over 1,000 entries submitted by over 110 contestants from 33 countries. The awards ceremony of the Photo Contest will be held at 2 p.m. this Saturday outside the CAFIEW Book Bar along the Dasha River Ecological Corridor in Nanshan District. Here we present you some award-winning pictures: #photos #photography #photographers #expats #shenzhen"
  },
  {
    "id": 1755928357563453551,
    "content": "Guangdong Governor Wang Weizhong extends his greetings to compatriots at home and abroad and friends worldwide on the #ChineseNewYear’s Eve. His message reflects on #Guangdong’s achievements of 2023, emphasizing the province's commitment to implementing the guiding principles of the CPC National Congress and the vision set forth by General Secretary Xi Jinping. The message highlights Guangdong's progress in various aspects, including economic development, innovation, cooperation with Hong Kong and Macao, infrastructure, and improvements in people's well-being. It also outlines the province's plans for the future, emphasizing further reform, opening-up, and strengthening ties with overseas Chinese."
  },
  {
    "id": 1762771997514428435,
    "content": "A delegation led by Yang Jun, secretary of the CPC #PingshanDistrict Committee, visited London, Cambridge, Oxford, and Essex, the U.K. on Feb. 22-24, establishing connections with global innovation resources and exploring new development opportunities. During their trips to various prestigious institutions and organizations, including the Cell and Gene Therapy Catapult (CGT Catapult), Nick Dutton Technical Services Ltd., Imperial College London, Center for Advanced Photonics and Electronics (CAPE) in the University of Cambridge, University of Oxford, and the Francis Crick Institute, the delegation engaged in discussions about technological innovation cooperation, talent exchanges, and project commercialization."
  },
  {
    "id": 1869211881606709546,
    "content": "Shenzhen Bao’an International Airport achieved a historic single-day record with 200 inbound and outbound #flights Dec. 12. So far this year, the number of international and regional flights at the #airport has rapidly increased, exceeding 51,000 flights, a year-on-year increase of 62%. The increase is attributed to the expansion of #Shenzhen’s foreign trade, coupled with the implementation of policies and measures that facilitate #travel for both Chinese nationals and international travelers, thereby significantly boosting demand for sightseeing, visiting relatives and friends, and business travel, according to a Shenzhen Special Zone Daily report yesterday. #airports #ShenzhenTravel #ChinaTravel #China"
  },
  {
    "id": 1887029635994804284,
    "content": "Welcome to #Shenzhen! The Shenzhen Bao'an International Airport now has a dedicated International Service Center (Terminal 3, 1st floor, near international arrivals). Get sorted with payment solutions, tourism info, transport options (including the Shenzhentong \"Bay Area PASS Card\"), SIM cards, and immigration assistance - all in one place! Watch the video to find out more! #airport #service #ShenzhenAirport #travel #InternationalTravel #convenience"
  },
  {
    "id": 1794355074917077316,
    "content": "An international delegation comprised of well-known foreign #vloggers, #ShenzhenGlobalCommunicationAmbassadors, and international students from the Shenzhen X9 Alliance of Universities and Institutes (X9 Alliance) visited the ongoing 20th China (Shenzhen) International Cultural Industries Fair (#ICIF) on Friday. They visited the Shenzhen News Group booth in Hall 14 and the Luohu District booth in Hall 10 at the main venue, the Shenzhen World Exhibition and Convention Center, among others. #ICIF2024 #shenzhen"
  },
  {
    "id": 1899663948888346764,
    "content": "The 16.2-kilometer-long Greenway Around Xili Lake has recently opened to the public, offering a serene escape within the bustling city. This #greenway seamlessly connects surrounding villages, urban areas, forests, and river landscapes, featuring nine scenic destinations and five rest stations. It’s the perfect place for citizens to embrace a poetic lifestyle amidst #nature. Tap the link to find out what the greenway has to offer: #outdoors #lifestyle #cycling #hiking #shenzhen"
  },
  {
    "id": 1836226414716297295,
    "content": "Four students from #Shenzhen achieved a historic milestone at the 47th #WorldSkillsCompetition, which concluded in #Lyon, #France, on Sunday, by securing three gold medals and one silver medal, according to the Shenzhen Municipal Human Resources and Social Security Bureau. Chen Jun’an, from the Shenzhen Institute of Information Technology, won a gold medal in the #OptoelectronicTechnology category. Students from the Shenzhen Institute of Technology performed exceptionally well. Zhuo Jiapeng won a gold medal in the newly introduced #IndustrialDesignTechnology category, Huang Jiajie bagged a gold in the #CloudComputing category, and Zhang Zihong secured a silver in the #GraphicDesign category."
  },
  {
    "id": 1736950900789559470,
    "content": "#China will strengthen its handling of criminal cases involving #drunkdriving, according to a set of guidelines released yesterday. Jointly issued by the Supreme People’s Court, the Supreme People’s Procuratorate, the Ministry of Public Security, and the Ministry of Justice, the guidelines, which will take effect Dec. 28, specified 15 scenarios subject to heavier punishment under the law, including recidivism. These guidelines noted 10 scenarios where suspension of sentence shall not apply. For example, cases that lead to traffic accidents and pose a significant danger will be subject to a heavier punishment. If drunk driving also accompanies other crimes, such as hit-and-run, the individual will be convicted and held to a stricter criminal responsibility."
  },
  {
    "id": 1856879844535275941,
    "content": "The 26th China Hi-Tech Fair () kicked off this morning at the Shenzhen World Exhibition Center in Bao’an, featuring over 5,000 global enterprises and organizations. With a focus on #AI, #greenenergy, and #lifesciences, the fair will highlight cutting-edge tech advancements. More than 30,000 international buyers and 400,000 professional attendees are expected, with procurement surpassing 100 billion yuan. The event also draws major investment institutions seeking innovation. Click the link to know more the highlights of the event:"
  },
  {
    "id": 1730964476969812283,
    "content": "The #2023UnderstandingChinaConference is presently underway at the Guangzhou Yuexiu International Congress Center, in the Yuexiu District of #Guangzhou, gathering more than 600 participants. Under the theme “China’s endeavors and unprecedented global changes: Expanding the convergence of interests and building a community with a shared future,” the event aims to provide a platform for the world to understand #China. More than 10 parallel forums and seminars, and a series of supporting events have been taking place after the opening ceremony. Check out this video to learn more:"
  },
  {
    "id": 1846463211518021772,
    "content": "The #HKSARGovernment has proposed to the Central Government further enhancements on Mainland residents’ tourism visit endorsements to #HongKong, including resuming the “multiple‑entry” Individual Visit Endorsements for #Shenzhen residents and expanding the coverage of pilot cities for implementing policies on the “one trip per week” Individual Visit Endorsements, according to the Hong Kong Chief Executive's 2024 Policy Address released today. Additionally, to foster closer people ties with #ASEAN countries, starting today, the Government will relax the criteria for nationals of #Cambodia, #Laos and #Myanmar applying for multiple‑entry visas for travel and business, and extend the validity period of multiple‑entry visas for these countries from two years to three years. The arrangement also applies to #Vietnamese, who have benefitted from the relaxation of the visa policy since last year."
  },
  {
    "id": 1925736317914079277,
    "content": "#ICIF2025 The \"barometer of China's cultural industry development,\" ICIF 2025, is in full swing! The 21st China (Shenzhen) International Cultural Industries Fair opened its doors yesterday at the Shenzhen World Exhibition and Convention Center in Bao'an. Join us for a video tour of day one! Weekend plans include #ICIF? Don't miss this ultimate visitor's guide: #culture #CulturalEvent #Shenzhen #China #WeekendFun"
  },
  {
    "id": 1839128447131726277,
    "content": "Yesterday, #UniversalMusicGroup () announced that the newly established #UniversalMusicChinaGreaterBayArea will be headquartered in #Shenzhen, a move that aims to cultivate emerging local #musical talent. As one of the three largest music companies in the world, alongside Sony Music Group and Warner Music Group, #UniversalMusic is the first major music production company to specifically target the Guangdong-Hong Kong-Macao Greater Bay Area (#GBA). Adam Granite, executive vice president of market development at Universal Music Group, said that Universal Music China GBA is part of the group’s global development strategy. “We will deeply root ourselves in the local culture, enhance support for local artists, and continuously elevate the position of the #Chinesemusic market within the global #music industry, allowing the world to hear the unique sounds of China,” he explained."
  },
  {
    "id": 1892049460374667477,
    "content": "More than 200 local primary and secondary schools in Shenzhen have taken measures to make noon naps more comfortable for students, allowing them to lie down during lunch breaks. The initiative has benefited more than 300,000 local students to date. In China, it is common for students to take a nap at school after lunch. Most students nap at their desks, but experts have warned that the practice is bad for children’s physical development. #China #Shenzhen #students #nap #lunchbreak #school #study"
  },
  {
    "id": 1728971172275220644,
    "content": "#Malaysia will grant 30-day #VisaFree #travel for #Chinese citizens starting Dec. 1 this year, Prime Minister Anwar Ibrahim announced Sunday. This move is to celebrate the 50th anniversary of the establishment of diplomatic ties between #Malaysia and #China next year, Anwar said in his remarks at the annual congress of People's Justice Party, of which he is the president. Anwar also thanked China for its decision to implement a unilateral visa-free policy for ordinary passport holders from Malaysia. (Source: Xinhua) #Asia #travelers #InternationalTravel"
  },
  {
    "id": 1731939818026975354,
    "content": "On Dec. 3, 12-year-old twin brothers Li Bingchen and Li Bingheng from #Shenzhen delivered a speech at a side event themed \"Canal Cities: Eye of Climate Change Storm\" during the which is underway in #Dubai and runs through Dec. 12. They shared the results of a survey they conducted on #teenagers' awareness of #climatechange. They called for increased education and awareness for teenagers about climate change, and they pledged to start from themselves and actively influence people around them to participate in actions to address climate change. The brothers' speech was met with a standing ovation from the audience."
  },
  {
    "id": 1906607483042627600,
    "content": "The “#HiShenGenzersNanshanTour” kicked off Friday at Shenzhen InnoX, as #Z10Club students from six countries — #Indonesia, #Russia, #Thailand, #Azerbaijan, #Egypt, and #Ghana — gathered for a journey into cutting-edge #technology. After a brief ceremony at Shenzhen InnoX, the Z10 members embarked on their sci-tech exploration. They reviewed three years of #innovation achievements made at Shenzhen InnoX and tried out smart portable health gadgets and massage rollers. “This product is excellent — I love it! It effectively relieves lower back pain, and I’ll definitely recommend it to my friends,” said Maria Korepanova, a Russian student from the Harbin Institute of Technology (Shenzhen), after trying a smart waist-support device. #GenerationZ #GenZ #HiShenGenZers"
  },
  {
    "id": 1735478165764763841,
    "content": "The “new three” products, namely #newenergyvehicles (NEVs), #lithiumbatteries, and #solarcells, have become the main drivers of #Shenzhen’s #foreigntrade in the past 11 months of this year, playing a key role in pushing the high-quality development of foreign trade, according to Shenzhen Customs. The total export value of electric passenger vehicles, lithium batteries and solar panels witnessed growth of 42.3% year on year, reaching 82.42 billion yuan (US$11.55 billion) from January to November, data showed."
  },
  {
    "id": 1919669876752580931,
    "content": "Good news for getting to the stunning #K11ECOAST! The Taizi Bay area now has a fresh #bus terminal with three new routes: M105: Connects to Longgang (Buji) via Shekou, Sea World, Futian (Shenzhen Bay Park, etc.), and Luohu. (¥2-¥7) 204: Heads to Taoyuan (near IKEA) via Shekou and Shennan Blvd. (¥2.5 flat) M400: Goes straight to Shenzhen Airport (Bao'an) and links up with several Metro stations. (¥2.5 flat) Plan your trip! #ShenzhenLife #Transportation #K11 #TaiziBay Click for more details:"
  },
  {
    "id": 1916386910639165663,
    "content": "#SIGEPChina2025, a #B2B #food service #tradefair focusing on #gelato, baked goods, and #coffee, opened on April 24 at the Shenzhen Convention and Exhibition Center in #FutianDistrict and ran through yesterday. During an interview with Shenzhen Daily, #MarcoCarniello, Chief Business Officer (CBO) of #ItalianExhibitionGroup S.p.A. (IEG), described #China as one of the most promising markets in IEG’s international business strategy. He also highlighted #Shenzhen as an ideal gateway to enter the Chinese market. Click in the video to learn more what the CBO has to say about Shenzhen."
  }
]