[
  {
    "id": 1760586858738884817,
    "content": "Shenzhen-based robotics company announced today that their industrial #humanoidrobot, #WalkerS, is now undergoing \"training\" at a factory of Chinese electric vehicle (EV) manufacturer . The training regimen involves tasks like adaptive walking for start-stop on the production line, robust mileage calculation, autonomous operation using perception and system data, and task scheduling. Check it out! #Robotics #TechTraining"
  },
  {
    "id": 1818827001752699069,
    "content": "#China's #PanZhanle set a new world record as he stormed to victory in the men's 100m freestyle at the #ParisOlympics on Wednesday. Pan touched the wall in 46.40 seconds, more than a second ahead of Australian Kyle Chalmers, who took silver. (Xinhua) #Swimming #ParisOlympics2024 #OlympicGames #GoChina"
  },
  {
    "id": 1727143595403354577,
    "content": "The highly anticipated Phase II extension of Shenzhen #Metro Line 8 is set to open Dec. 28, marking the city’s first direct Metro route to the popular Dameisha and Xiaomeisha beaches. The Phase II extension starts from the existing Yantian Road Station of Phase I, stretching eastward to Xiaomeisha Station, covering a distance of about 8.01 kilometers. It has four stations, namely Hong’anwei, Yantianxu, Dameisha, and Xiaomeisha. #subway #publictransport #shenzhen #travel"
  },
  {
    "id": 1793471531835875531,
    "content": "The highly anticipated 20th China (Shenzhen) International Cultural Industries Fair (#ICIF) will open today, featuring its main venue in Bao’an and 52 parallel subvenues across various districts. Among them, the subvenue at the Art Design Center in #LuohuDistrict stands out with its diverse exhibitions and workshops tailored for visitors and art enthusiasts alike. This year’s theme, “Artistic Life and Imagination,” brings together enterprises to host seven events, including exhibitions on original designs, digital media, and abstract art. The center also features a market selling various cultural and creative products and offers public workshops on the traditional craft of bamboo basket weaving. Don't miss out! #ICIF2024 #20thICIF #ICIF20Years #culture"
  },
  {
    "id": 1790207291494662427,
    "content": "A dazzling #drone & #fireworks showwas staged last week in #Marseille to celebrate the arrival of the Olympic flame! The show featured 800 #unmannedaerialvehicles (#UAVs) made by Shenzhen HighGreat Innovation Technology Development Co. Ltd. With a fleet of over 60,000 #drones, the company has presented thousands of drone performances in more than 300 cities around the globe. Its drones will continue to grace the sky above the iconic Palace of Versailles in #Paris with awe-inspiring aerial shows until the end of the #Olympics. #Paris2024"
  },
  {
    "id": 1772090698319450587,
    "content": "In an innovative leap for #logistics, the delivery time for local delicacies from #GuangmingDistrict to other districts has been halved by using #drone technology, Shenzhen Evening News reported. Fengyi Drones launched its low-altitude logistics route in the district Saturdaymarking a significant step forward in #Shenzhen's goal to establish a comprehensive #lowaltitude logistics network. Previously, it took 40 minutes to deliver Guangming pigeons, a beloved local delicacy, to residents’ hands by car. Now, the delivery time has been slashed to just 20 minutes. This service was showcased at the Fengyi Drone Operation Center in Bao’an District on Saturday. (Video: Shenzhen TV)"
  },
  {
    "id": 1676424166034247680,
    "content": "#Shenzhen has launched a #barrierfree electronic #map to provide customized routes for individuals with physical disabilities, the elderly, and others. Users can access the map via WeChat miniprogram “#春芽无障碍地图” to locate basic facilities, shopping malls, hospitals, etc."
  },
  {
    "id": 1796862652775616654,
    "content": "Despite the heavy rain today, residents and car enthusiasts showed up in full force at the 28th GBA Auto Show today. The Shenzhen World Convention and Exhibition Center was buzzing with excitement and packed with eager attendees. #GBAAutoShow #Shenzhen #CarLovers"
  },
  {
    "id": 1696069511643099374,
    "content": "Starting from Aug. 30, incoming individuals to #China will not be required to undergo #COVID19 #nucleicacid or #antigen tests before entry, Foreign Ministry spokesperson Wang Wenbin said at a routine press conference today."
  },
  {
    "id": 1791040370517885388,
    "content": "#Shenzhen residents can soon take the #Metro to #Dongguan! Line 10 will be extended to Fenggang in Dongguan, allowing transfers to Lines 16 and 21! The Shenzhen Public Resource Trading Center website has announced the procurement tender for the detailed transportation planning project of the Shenzhen section of the eastward extension of Shenzhen Metro Line 10. According to the Shenzhen Rail Transit Network Plan (2016-2035), Line 10 is an important rail trunk line in operation on the central development axis of Shenzhen, starting from Futian Checkpoint Station in central Futian and ending at Shuangyong Street Station in Pinghu. It is reported that this line will have four stations in the Dongguan section at Longping Road, Youganpu, Guanjingtou, and Dayunchengbang."
  },
  {
    "id": 1793940323632398460,
    "content": "#KennethFok, Chairman of #HongKongArtsDevelopmentCouncil, speaks at the Sub-forum on Cultural Strength and Development Opportunities of the Greater Bay Area. #GBA #Shenzhen #HongKong #ICIF #ICIF2024"
  },
  {
    "id": 1829468022849106328,
    "content": "#JoshuaSZFinds On June 30, the seven-year project #ShenzhenZhongshanLink (#ShenzhongLink) was completed and opened to the public. In anticipation of the grand opening, photographers prepared their cameras to capture the iconic #construction project. From the Shenzhen side, the Shenzhong Link enters directly into an underground tunnel, making it difficult to get clear photos of the above-water bridge section, which was too far away. I decided to take an intercity bus that stops near the port side of the bridge on the #Zhongshan side. The bus ride took about an hour and cost 18 RMB. After arriving, I rented a public e-bike and rode to a nearby park where the bridge connects to the land. There, on a beautiful, clear blue day, I took plenty of photos standing beneath the giant pillars of the bridge as cars passed overhead toward #Shenzhen. Ins: heysupjosh X: Facebook: Joshua Fernandez"
  },
  {
    "id": 1790574237390098452,
    "content": "Marking its 20th anniversary, the China (Shenzhen) International Cultural Industries Fair (#ICIF), a cornerstone event in #China’s cultural calendar, is set to break new ground with its ever-increasing internationalization. Running from May 23 to 27 at the Shenzhen World Exhibition & Convention Center in Bao’an District, the fair will showcase the cultural diversity and creative richness of China and beyond. It is expected to draw over 90,000 visitors from around the globe. #culture #creativity #shenzhen #CulturalChina"
  },
  {
    "id": 1848558072668537136,
    "content": "Get ready for takeoff! The inaugural \"Aerial F1\" Drone Super League (Longgang) has officially begun in Longgang District. Over 260 top #drone pilots from across #China are battling it out for the title of Longgang's low-altitude speed king. From traditional racing to innovative challenges like drone football, there's something for everyone. Even young pilots as young as 9 are joining the fun! Mark your calendar and don't miss a moment of this exciting week-long event! #drones #DroneRacing #Shenzhen #TechSports"
  },
  {
    "id": 1649351487913328642,
    "content": "The 2020 national population census found that the average age for a Chinese person to get married for the first time was 28.67 years, in contrast to 24.89 years back in 2010. Some young people share their stories about #love and #marriage in this article."
  },
  {
    "id": 1743614055527395599,
    "content": "In #Shenzhen, folks aren't just out walking real #dogs; they're also taking a stroll with ROBOT DOGS! Take a look at this adorable sighting, which drew paws-itive attention from passersby at MixC World in Nanshan today. #robot #robotdogs #pets #TechNews"
  },
  {
    "id": 1685849560831152128,
    "content": "The highly anticipated 2023 ASEAN China Greater Bay Area Economic Cooperation (Qianhai) Forum was held in #Shenzhen on Saturday. The event was attended by representatives from 10 #ASEANcountries, over 150 foreign guests and 350 delegates."
  },
  {
    "id": 1917402988160901149,
    "content": "After a great success in #Moscow, #Shenzhen original #dancedrama \"#WingChun\" continues its captivating tour in #Russia and is set to be staged at the historic #MarinskyTheater in St. Petersburg from April 30 to May 1. At the world-famous #BorisEifmanDanceAcademy, one of Russia's most prestigious #dance institutions that is located at the heart of St. Petersburg, Shenzhen Daily had an exclusive talk with Mr. #KonstantinMatveev, the artistic director of Boris Eifman Dance Academy, who shared his insights into this remarkable artistic and #culturalexchange. Click in the video to take a listen!"
  },
  {
    "id": 1765579559729332593,
    "content": "Ride #Shenzhen #Metro Line 16, the \"Hakka Culture Inheritance Line,\" to discover the beauty of #Hakka culture in Pingshan and Longgang districts. Stations have been transformed into art and nature #museums with Hakka-themed #installations and plant specimens, showcasing local heritage. Don't miss this cultural journey! #culture #art #Metro"
  },
  {
    "id": 1791428313086611462,
    "content": "#JoshuaSZFinds #Shenzhen's iconic cityscape, adorned with flashing LED #lights on every office building, creates a futuristic ambiance at night. Various #buildings showcase diverse #lightdesigns, ranging from futuristic displays to subtle illuminations. Not only do these lights contribute to the city's aesthetic appeal, but they also provide safety for pedestrians and enhance the nighttime exploration experience in this pedestrian-friendly city. Additionally, the abundance of #lighting is better for photographers and vloggers alike, giving us another side of the city to capture without having to worry when the sun goes down. As you probably have seen before on social media, lights literally transform the city into a scene from the movie #Bladerunner! #nighttime #nightview #landscape #photography Ins: heysupjosh X: Facebook: Joshua Fernandez"
  },
  {
    "id": 1798902140779577712,
    "content": "Expat representatives have lauded #Shenzhen’s new comprehensive multimedia guide, designed to assist #expats and #foreignvisitors in navigating city life. Unveiled yesterday by the Foreign Affairs Office and EyeShenzhen, the guide features informative videos addressing common challenges such as taxation, medical services, public transportation, and SIM card purchases. It also includes a multilingual handbook offering insights and valuable tips about Shenzhen. Michael John Eagleton, an Australian businessman with 26 years in Shenzhen, finds the guide “extremely useful,” especially praising the improved, convenient taxation process. Tafadzwa Mackenzie Kadere, a Shenzhen Global Communication Ambassador from the U.K., highlighted the practicality of the guide for personal income tax filing. #survivalguide #lifeguide #china"
  },
  {
    "id": 1772811305852064028,
    "content": "#Cleaning #robots can do more than just scrub floors — they now can automate the cleaning process and adapt to different surfaces. Dozens of intelligent cleaning robots from 16 enterprises were gathered at the First Shenzhen (International) Intelligent Sanitation Cleaning Robot Competition at the Shenzhen World Exhibition & Convention Center on Monday, to showcase skills such as wading through water, climbing slopes, automatically recognizing garbage, and avoiding obstacles. Multiple “examination points” were established to test the robots’ abilities, including identifying low obstacles, avoiding bicycles, and cleaning edges. These abilities were tested in simulated venues like parks, squares, and pedestrian, non-motorized, and auxiliary lanes."
  },
  {
    "id": 1829811338350379281,
    "content": "Sir Sherard Louis Cowper-Coles, chairman of China-Britain Business Council: ‘Wing Chun’ bridges two great civilizations."
  },
  {
    "id": 1774976135492952176,
    "content": "Alla Diasamidze, from #Georgia, smoothly withdrew 200 yuan (US$27.6) in cash with her overseas bank card and exchanged the two 100-yuan notes for smaller notes of the same value at the Agricultural Bank of China Shenzhen Branch in Luohu District yesterday morning. The service Diasamidze used is called #ChangePurse, which was recently launched by major financial institutions in #Shenzhen under the guidance of the People’s Bank of China (PBOC) Shenzhen Central Sub-branch. The service is now available at 1,640 bank branches and 31 currency exchanges in major checkpoints and transportation hubs in Shenzhen. #bank #payment"
  },
  {
    "id": 1714109628261576791,
    "content": "A total of 1,273 enterprises from #Shenzhen attended the #134thCantonFair that opened in #Guangzhou on Sunday. The fair will run through Nov. 14 in three sessions. The number of booths and brands from Shenzhen increased by 11% and 48%, respectively, compared with last year, data showed. #trade #Guangdong #GBA"
  },
  {
    "id": 1612646382623678467,
    "content": "Dozens of #birdwatching volunteers were organized to observe #blackfacedspoonbills from Friday to Sunday at areas at #ShenzhenBay by the Shenzhen Bird Watching Society and Shenzhen Mangrove Wetlands Conservation Foundation (MCF). #birds #census #nature"
  },
  {
    "id": 1831686598385373551,
    "content": "At 7 p.m. today, the Shenzhen Meteorological Observatory upgraded the #typhoon alert for several districts, including Yantian, Dapeng, parts of Nanshan and Bao'an, and surrounding coastal areas, from blue to yellow. The approaching #SuperTyphoonYagi is expected to bring stronger winds and heavy rain, with gusts reaching 8-10 levels in coastal and highland areas. All schools, kindergartens, and daycare centers across the city are suspended until further notice. Stay safe and take precautions!"
  },
  {
    "id": 1667410906849091585,
    "content": "The #EyeShenzhen #multilingual official website goes online in trial operation today, offering #Shenzhen's latest news, related information and services in #Spanish, #French, #German, #Japanese, #Korean, #Russian, #Arabic and #Portuguese, in addition to #English. #websites"
  },
  {
    "id": 1644168504164352000,
    "content": "An innovation team from SZ Bao’an High School Group has invented a pill box to meet the medication needs of #visuallyimpaired people. The idea was inspired by a field visit to a massage salon that employs the blind or visually impaired people. #invention"
  },
  {
    "id": 1642707128015261696,
    "content": "The number of #business entities in #Shenzhen had exceeded 4 million by the end of March, a record high under ever-improving business climate and policy-based support to stimulate the vitality of market entities and ensure they survive and thrive."
  },
  {
    "id": 1744261798575173910,
    "content": "Step into the captivating world of #LianhuaHillPark in Futian CBD! The enchanting bald cypress trees paint a serene reddish-brown canvas, especially in autumn and winter seasons when their leaves transform into a breathtaking russet hue. Don't miss this magical display of #nature's beauty at #FairyLakeBotanicalGarden, #HonghuPark in Luohu District, and of course, Lianhua Hill Park. Grab your camera and immerse yourself in this stunning scenery – it's a moment worth capturing!"
  },
  {
    "id": 1908550996336533882,
    "content": "The globally renowned internet sensation IShowSpeed experienced a drone show at Shenzhen Talent Park today. He said that Shenzhen is really a tech city. #IShowSpeed #Speed #droneshow #drone #China #Shenzhen #tech"
  },
  {
    "id": 1623501597216227334,
    "content": "#Shenzhen nurtures #wetlands covering surface area of 35,000 hectares, including 296 hectares of #mangrove forests, data from an investigation report on SZ’s wetland resources showed.The report was released during GD’s themed event on wetland restoration."
  },
  {
    "id": 1749254394309472758,
    "content": "A blood transportation #drone platform, the first of its kind in the country, was officially put into use in #Shenzhen on Jan. 19. Integrating #5G technology and artificial intelligence (#AI), the platform is said to help ensure safety and improve efficiency in blood transportation. Jointly developed by the Shenzhen Blood Center and China Telecom Shenzhen Branch, the platform has utilized the advantages of 5G’s large bandwidth, combined with AI and other #technologies, to render high-definition images and real-time feedback of cold-chain temperature throughout the entire process. #drones #TechNews"
  },
  {
    "id": 1847171844522365004,
    "content": "The #ShenzhenSportsCenter’s #stadium in Futian District is back and better than ever! With a seating capacity of 15,000, the newly renovated stadium is ready to host the #Shenzhen #basketball team’s first home game of the 2024-2025 China Men’s Professional Basketball League regular season this evening. Renovation of the Shenzhen Sports Center, a city landmark built in 1985, began in 2020. Covering an area of 435,400 square meters, the center features a gymnasium, a stadium, a swimming and diving complex, a badminton and tennis center, and other public facilities. The center is set to host events for the 15th #NationalGames, which will be held in November 2025."
  },
  {
    "id": 1872176130511585599,
    "content": "#Macao lit up the night sky yesterday with a breathtaking #fireworks display over the Sai Van Bridge, presented by the Macao Government Tourism Office. This dazzling show kicked off a month-long celebration marking the 25th anniversary of the establishment of the #MacaoSpecialAdministrativeRegion (Macao SAR). But that's not all! An 84-night light show, already underway since Dec. 20, is illuminating landmarks across the SAR. Follow our reporter Liu Xudong's lens for a glimpse of these stunning spectacles. #MacaoSAR25Years #LightShow #Celebration"
  },
  {
    "id": 1734107757232750845,
    "content": "This afternoon, our reporters spoke with #sailors gearing up for the 2023 World Match Racing Tour (WMRT) Shenzhen·Baoan Final and the World Bay Area Regatta happening from Dec. 12 to 17 at OH Bay, Bao’an District. Amidst their training, they witnessed a breathtaking scene: tens of thousands of #greatcormorants gracefully soaring over the bay"
  },
  {
    "id": 1678229567734165504,
    "content": "Five #Shenzhen #athletes are expected to make a splash at the #2023WorldAquaticsChampionships (), which will take place in #Fukuoka, #Japan from July 14 to 30. The Chinese Swimming Association has assembled a 41-strong squad for the event."
  },
  {
    "id": 1828635705456894061,
    "content": "A delegation from the #SpanishSocialistWorkersParty (#PSOE), led by #JuanLobato (), visited #Shenzhen to experience its urban development. Yu Xinguo, Shenzhen's deputy Party chief, welcomed them at Wuzhou Guest House. Both sides aim to improve communication and cooperation in industry, technology, culture, and tourism. Founded in 1879, PSOE is #Spain's oldest political party and a center-left party in Spain’s political spectrum. The group arrived for a four-day visit. Lobato praised Shenzhen's rapid growth, crediting the Communist Party of China and the government. He noted, “There is much we can learn from Shenzhen and apply in Spain.\""
  },
  {
    "id": 1676771536055980032,
    "content": "Delegates from 10 #Macao-based #English and #Portuguese #mediaoutlets visited #Shenzhen’s landmarks and technology companies yesterday, concluding their four-day tour of mainland cities in the Greater Bay Area (#GBA), which began Sunday."
  },
  {
    "id": 1892052571633877453,
    "content": "Budget smartphone maker Honor Terminal has launched the Honor Alpha Plan, focusing on developing an artificial intelligence (AI) ecosystem. Details related to the Alpha Plan initiative will be unveiled at the 2025 Mobile World Congress, scheduled to be held in Barcelona, Spain from March 3 through March 6, the company announced. #phone #Honor #AI #tech #China #Shenzhen #AlphaPlan #MobileWorldCongress #Spain #Barcelona"
  },
  {
    "id": 1803627800915747179,
    "content": "A cohort of 25 students from top universities across the United States began their five-day visit to #Shenzhen yesterday to gain insights into China’s remarkable progress in higher education and #science and #technology. The students, invited by the Chinese People’s Association for Friendship with Foreign Countries and the China-United States Exchange Foundation as part of the Sino-U.S. Bridge Program, are visiting China for nearly a month from June 7 to July 6. #China #US #tech"
  },
  {
    "id": 1707283885430878290,
    "content": "EyeShenzhen's specially-invited #contentcreator Rafael Saavedra (), who is also a #Shenzhen global communication ambassador, has arrived in #Hangzhou. Let's follow his lens to discover more about the #AsianGames and the city! #Zhejiang #HangzhouAsianGames"
  },
  {
    "id": 1673535502706933760,
    "content": "The Cape Mountain manor in #CapeTown, #SouthAfrica, was enveloped in a joyful atmosphere as a delegation consisting of 46 diplomatic envoys from the #BRICS countries, gathered for a #winetasting and buffet dinner at the #vineyard May 30."
  },
  {
    "id": 1698962613336686904,
    "content": "As autumn brings cooler evenings, immerse yourself in the spellbinding beauty of #lightshows around the city. Click in the video and check out the ongoing mesmerizing light show in Longhua District! #nightlife #leisure #shows #shenzhen"
  },
  {
    "id": 1618600098866556930,
    "content": "Edcia Alejandra Alcocer Carpio from #Bolivia felt like having run a marathon after trying to catch up with the #YinggeDance performance, a national folk art of #intangibleculturalheritage that is popular in the #Guangdong's #Chaoshan area, on Jan. 23."
  },
  {
    "id": 1759863550020059241,
    "content": "At Luohu Exit & Entry Frontier Inspection Station in #Shenzhen, quick actions by police officers saved a foreign tourist who fell backward on an escalator. American #tourists Philip and his wife sought help from police officer Chen Shijie for entry procedures. With heavy luggage and in their senior years, Chen assisted them and tragedy struck when Philip fell. But with another police officer's quick response and the help of officers and bystanders, Philip was safe and their entry process was completed smoothly. #SafetyFirst #TouristRescue #shenzhen"
  },
  {
    "id": 1807595917627036061,
    "content": "Phase II of the #GuangzhouShenzhenRiversideExpressway — designed to provide local drivers with easy access to the Shenzhen Bao’an International Airport — opened yesterday in tandem with the opening of the #ShenzhongLink. The #expressway not only connects to the Shenzhong Link, but also to the #Guangzhou-#Shenzhen Expressway and Jihe Expressway, greatly enhancing expressway connectivity in the eastern and western regions of Shenzhen."
  },
  {
    "id": 1860878004605595829,
    "content": "If you’re interested in #Taiwanese culture, make sure not to miss the #TaiwanInnocultureFair at One Avenue in Futian District. A total of 150 booths are showcasing a variety of #snacks from #Taiwan’s vibrant night markets, cultural creative products, handicrafts, specialties, and more. Visitors can also enjoy a baseball experience with a former Taiwanese #baseball pro on-site. In its 8th edition in #Shenzhen, the fair will run until 8 p.m. today. Catch the last chance to immerse yourself in charming Taiwanese culture!"
  },
  {
    "id": 1666275198184878081,
    "content": "#ICIF2023 A fan of traditional Chinese arts&crafts? Come to visit Hall 14 in the SZ World Exhibition & Convention Center, you won't be disappointed! Chinese intangible cultural heritage items such as Tang Dynasty tri-colored glazed pottery are on display."
  },
  {
    "id": 1856160575405076928,
    "content": "The total #foreigntrade value of #Shenzhen’s three comprehensive #bondedareas exceeded 396 billion yuan (US$55 billion) in the first three quarters of this year, a year-on-year increase of 33.8%, and accounted for 11.7% of the city’s total, according to Shenzhen Customs yesterday. Among the three bonded areas, the Qianhai Comprehensive Bonded Area posted the most significant growth, with a year-on-year increase of over 48%, reaching a foreign trade value of 264.2 billion yuan. The Pingshan and Yantian bonded areas contributed 41.29 billion yuan and 90.6 billion yuan, respectively, with increases of 16% and 6.98%."
  },
  {
    "id": 1742449858076917927,
    "content": "#Bookworms, unite! Immerse yourself in #nature & #literature at Zimo Books in Lianhua Hill Park in central Futian. This charming #bookstore-#café combo is a haven for #bibliophiles & #naturelovers alike. Cozy nooks for #reading: Curl up with a good book in the sunlit reading area. Plant parenthood awaits: Discover hidden gems in the curated plant-selling section. Fuel your literary adventures: Sip on a latte in the café & soak in the #park vibes."
  },
  {
    "id": 1722071092893020213,
    "content": "Good news for late-night #travelers to/from Shenzhen Bao'an International Airport! The Airport Express is now running 24/7, according to the city's transportation authority. Starting this Saturday, the Shenzhen Bus Group introduced overnight service on 8 Airport Express routes, ensuring smooth connections to late arrivals. These routes serve various districts, and fares remain unchanged from daytime. #airports #travel #publictransport #shenzhen"
  },
  {
    "id": 1818830105864798424,
    "content": "Starting today, mainland residents who visit the #HongKong and #Macao special administrative regions (SARs) will be able to cross all entry checkpoints, except the Hengqin port, with up to 15,000 yuan (US$2,076) worth of #dutyfree goods, Shenzhen Customs said Tuesday. The maximum duty-free goods that adult visitors are allowed to carry when entering from Hong Kong and Macao were raised to 12,000 yuan from 5,000 yuan starting July 1, 2024, according to a joint announcement published by China’s finance, customs, and taxation departments June 28. The new limit initially covered six border crossings, including the Luohu, Futian, and Shenzhen Bay checkpoints, as well as the Gongbei Port, the Zhuhai exit of the Hong Kong-Zhuhai-Macao Bridge, and the West Kowloon Station of the Guangzhou-Shenzhen-Hong Kong Express Rail Link."
  },
  {
    "id": 1851875533950456200,
    "content": "Forget traffic jams! Tourists in #DapengNewArea now have the opportunity to experience #airtaxi services thanks to a partnership between Heli-Eastern and the Yun Resort Shenzhen Longcheer. The resort will serve as the new #helicopter route’s terminal. The strategic cooperation agreement, which was announced during a signing ceremony at the resort Tuesday, is part of Dapeng’s plan to develop the low-altitude economy. According to Cai Wuqun, general manager of the strategic planning department of Heli-Eastern, the 40-kilometer helicopter ride between Yantian District and the resort only takes 10 minutes. #shenzhen #travel #lowaltitude"
  },
  {
    "id": 1737755755003138250,
    "content": "On Dec. 18, #XiaomiGroup Senior Vice President and President of the Mobile Phone Department Zeng Xuezhong posted on Weibo to celebrate the successful topping out of 's international #headquarters and the sixth anniversary of Xiaomi's #Shenzhen R&D center. According to public information, Xiaomi's international headquarters project is located in the core area of Houhai Central District, Nanshan District. The total building area is 46,000 square meters, including Xiaomi Home, office areas, employee canteen, and underground parking garage. After completion, it will become another important headquarters of Xiaomi Group. The building is designed by Peter Schubert, a partner of international renowned architectural firm #ennead, and constructed by the First Company of China Eighth Engineering Bureau Ltd. It boasts a 360-degree LED screen that surrounds the four-story skirt of the building. #architecture #design"
  },
  {
    "id": 1646699797498449926,
    "content": "Three internationally renowned #design heavyweights will share their #innovation and #entrepreneurship stories in SZ and the Guangdong-Hong Kong-Macao Greater Bay Area (GBA) at the upcoming “Shenzhen Night” event in the city of Huizhou on Saturday night."
  },
  {
    "id": 1762648775024329129,
    "content": "Prominent #Shenzhen enterprises, including , , , and #Transsion, are presenting a wide array of cutting-edge #technologies and products at the #2024MobileWorldCongress () in #Barcelona, Spain. The ongoing four-day #MWC, which will end tomorrow, has attracted over 300 Chinese tech companies to participate in the gathering. Highlighting their offerings at the congress, Huawei announced that 2024 marks the beginning of #5G-A commercial usage, which integrates cloud and #AI technologies with significant potential for commercial growth for operators. #MWC2024 #MWCBarcelona2024"
  },
  {
    "id": 1905440158150975623,
    "content": "American shutterbug Daniel Miller journeyed from Zhaoqing to Xixiang Subdistrict in Bao’an District specifically to capture the vibrant Sanyuesan temple fair. Let's hear his remarks about the event! #Shenzhen #Sanyuesan #TempleFair #Culture #intangibleculturalheritage"
  },
  {
    "id": 1856522448558330294,
    "content": "The 15th China International Aviation and Aerospace Exhibition, also known as #AirshowChina, kicked off in #Zhuhai on Tuesday. Among the highlights, #China's #J20 and #J35A stealth #fighterjets, as well as #Russia's Su-57 fighter jet, staged flying shows one after another. This is the first time that the three types of stealth fighters from China and Russia have been exhibited at the same time in Airshow China. #AeroSpace #aviation #Airplane #AirshowChina2024"
  },
  {
    "id": 1820651091132109137,
    "content": "#Japanese #students wowed by #Shenzhen's futuristic vibe! A group of 16 Japanese uni students are exploring Shenzhen for a week, soaking up the city's energy and learning about its rapid development. From electric cars to stunning skylines, they're amazed by the city's transformation. Having visited Los Angeles, Vancouver, and London, Mibuki Kobayashi from Kobe City University of Foreign Studies is particularly impressed with Shenzhen’s high-tech environment and the prevalence of electric vehicles. “I haven’t seen so many electric cars in a city, so I would say Shenzhen is the most futuristic,” Kobayashi told Shenzhen Daily. #YouthExchange #FutureCity Click the link to learn more:"
  },
  {
    "id": 1693436942514553045,
    "content": "Amidst enthusiastic applause and cheers from the audience, host #China took a 1-0 victory over #Slovakia in their opener at the 2023 IIHF () Ice Hockey Women’s World Championship Division I Group A, which opened at Shenzhen Universiade Sports Center in Longgang District yesterday. Kong Minghui scored for China. In the opening match of the tournament, #Denmark smashed the #Netherlands with a convincing 6-1 victory. In a following match, #Austria beat #Norway with a resounding 4-0 scoreline. #icehockey #icesports #sports #shenzhen"
  },
  {
    "id": 1793466422586491248,
    "content": "The 20th China (Shenzhen) International Cultural Industries Fair (#ICIF) will officially open its doors at the Shenzhen World Exhibition & Convention Center in Bao’an District today. Are you curious about what to explore at the fair? Are you interested in fantastic cultural projects and cutting-edge technologies? Join us as we highlight some of the fair’s key exhibits and items: #ICIF2024 #20thICIF #ICIF20Years #culture #shenzhen"
  },
  {
    "id": 1716639691737551212,
    "content": "The #25thChinaHiTechFair (), the country’s top scientific and technological fair, is scheduled to be held in #Shenzhen from Nov. 15 to 19, its organizer has announced. The fair will take place simultaneously at the Shenzhen Convention and Exhibition Center in Futian District and Shenzhen World Exhibition and Convention Center in Bao’an. #technology #TechNews #exhibitions"
  },
  {
    "id": 1749620494700261552,
    "content": "#ExpatsInShenzhen Jonathan Lee Hun Leong's entrepreneurial journey began at a young age when he founded his first company, an education institute, in his home country #Malaysia at the age of 18. Eleven years later, in 2019, he arrived in #Shenzhen with a bigger ambition: to rekindle his dream of #entrepreneurship by learning from the best in the city that has birthed numerous success stories. Lee’s decision to choose Shenzhen as his next entrepreneurial chapter stemmed from the city’s reputation as a manufacturing and innovation hub, as his best friend Victor from Sweden once told him, “If you want to become a great entrepreneur, you need to learn from the best. And China is the best.” From his own point of view, Shenzhen is the place where one could find manufacturers, supply chain and connections. #entrepreneurs #Expats"
  },
  {
    "id": 1838410688995434871,
    "content": "Nearly 100,000 foreign #travelers have entered #Shenzhen under #China’s #visafree entry policy via the #XRLWestKowloonStationCheckpoint in #HongKong this year, up by 1,530% over the same period last year, data from the checkpoint show. One out of every seven inbound international visitors enjoyed the policy. Yesterday the checkpoint at #WestKowloon, the Hong Kong terminus of the Guangzhou-Shenzhen-Hong Kong Express Rail Link, celebrates its 6th anniversary of opening. This year, the checkpoint has handled a total of 700,000 inbound international travelers so far, a year-on-year increase of 104%."
  },
  {
    "id": 1626056444947877888,
    "content": "#Shenzhen residents’ per capita annual #disposableincome reached 72,718 yuan (US$10,622.75) in 2022, up 2.6% year on year, after deducting the price factor, according to data released by the SZ survey team of the National Bureau of Statistics on Monday."
  },
  {
    "id": 1795430530814812208,
    "content": "#Shenzhen signed a memorandum of understanding (MOU) with #Vienna on May 24 to establish friendly exchange relations with the capital of #Austria, which is widely regarded as the classical music capital of the world. The establishment of friendly exchange relations is expected to promote cooperation between Shenzhen and Vienna in areas such as trade and investment, life sciences, health care, environmental protection, start-ups, urban sustainable development, new energy, digital industries, and creative industries. #FriendlyExchangeCities"
  },
  {
    "id": 1784875245163176247,
    "content": "The #ChunfengTunnel, the largest shield tunnel under construction in South China with an excavation diameter of 15.8 meters, located in Luohu District, broke through April 28. It is expected to be open to traffic by the end of this year. The #tunnel is 5,078 meters long, with 3,603 meters being a shield tunnel excavated using the domestically developed ultra-large diameter slurry balance shield machine \"Chunfeng No. 1.\" As vehicles will travel on two levels in the future, the excavation diameter of the tunnel reaches 15.8 meters. Once completed, the tunnel will double the transportation capacity of the Chunfeng Road section and significantly improve the traffic situation of the Chunfeng Overpass in south Luohu. #traffic #transportation #infrastructure"
  },
  {
    "id": 1881274243280933069,
    "content": "#YearoftheSnake is almost here! #Shenzhen is buzzing with excitement as #ChineseNewYear approaches. Markets are overflowing with shoppers, everyone's busy preparing for the #festival. From vibrant #flowermarkets to delicious reunion dinners, there's something for everyone. Click the link to discover the best ways to celebrate #CNY in Shenzhen!"
  },
  {
    "id": 1778606744102711317,
    "content": "Chinese #pianist and Shenzhen's Goodwill Ambassador was honored with a star on the #HollywoodWalkofFame on April 10 (local time), leaving behind his personal star imprint. He has made history as the first-ever Chinese #musician to receive this prestigious accolade, and as the first Asian pianist to be honored on the Hollywood Walk of Fame."
  },
  {
    "id": 1715691742140453272,
    "content": "\"My Town, My Folk,\" a gathering of New Era Chinese urban folk songs, will be held at OH Bay in #Shenzhen this evening. Many talented folk #singers, #bands, #musicians, and guests came together to sing at this event that belongs to Shenzhen's \"new folk music\" scene and to the music community. This folk song gathering brought together nearly 50 folk singers from over 20 cities across the country. Singer Han Xiaojiu was interviewed by the media before the performance. #music #folksongs"
  },
  {
    "id": 1723888921292296366,
    "content": "The finals for the fourth #CrossStraitStudentBaseballLeague started at the Zhongshan Park #baseballcourt in Nanshan District in #Shenzhen on Saturday, marking the start of the Cross-Strait Exchange and Integration Month. The inauguration ceremony gathered more than 2,000 guests from the mainland and #Taiwan. Learn more about the event:"
  },
  {
    "id": 1905905394624659570,
    "content": "A 7.9-magnitude #earthquake struck central #Myanmar at 2:20 p.m. March 28. Per state media reports March 29, the #quake has killed 1,002 people, injured 2,376 and left others missing across affected areas. Shenzhen Public Welfare Rescue Team has sent 23 #rescue workers and 1 rescue dog to assist in relief efforts, Shenzhen Media Group reported. #disasterrelief #Shenzhen"
  },
  {
    "id": 1871378430501232897,
    "content": "Shenzhen Bao’an International Airport announced yesterday that it has surpassed 60 million passenger trips this year, marking a new milestone for the city. The #airport has become the fourth in the Chinese mainland to achieve such a high annual passenger volume, the Information Office of Shenzhen Municipal People's Government said in a statement today. #Shenzhen #transportation #China"
  },
  {
    "id": 1724624952102642096,
    "content": "As the clock ticks down to 2024, #running enthusiasts are gearing up for the much-anticipated return of the #ShenzhenDapengNewYearMarathon, which is scheduled to commence at 7:30 a.m. Jan. 1, 2024. The starting point for the event will be the Dapeng Peninsula National Geopark, with registration now available through the “深圳大鹏新年马拉松” WeChat account. #marathons #runners #Shenzhen"
  },
  {
    "id": 1698873424440066442,
    "content": "Over 1,000 #artists and #art groups from more than 30 countries and regions, mostly along the #BeltandRoad, will gather in #Shenzhen from Sept. 8 to Oct. 31, staging a total of 59 performances for a 54-day #music feast at various venues across the city, according to a press conference held by the city government yesterday. On the occasion of the 10th anniversary of the China-proposed #BeltandRoadInitiative, the #2023ShenzhenBeltandRoadInternationalMusicFestival has invited 32 outstanding art troupes from around the world, including #Russia, #Austria, #Italy, #Montenegro, #Poland, #Romania, #Iran, the #UK and #France. #musicfestival #BRI"
  },
  {
    "id": 1834511654979248308,
    "content": "Chinese lawmakers on Friday voted to adopt a decision on gradually raising the statutory #retirement age in the country, marking the first adjustment in the arrangement since 1950s. According to the decision adopted at the 11th session of the Standing Committee of the 14th National People's Congress, the statutory retirement age for men will be gradually raised from 60 to 63 in the course of 15 years starting 2025, while that for women cadres and women blue-collar workers will be raised from 55 to 58 and from 50 to 55, respectively. Starting 2030, the minimum year of basic #pension contributions required to receive monthly benefits will be gradually raised from 15 years to 20 years at the pace of an increase of six months annually."
  },
  {
    "id": 1707334860149490095,
    "content": "The #Shenzhen #dancedrama “#WingChun” has caused a sensation in #Singapore with its highly anticipated overseas debut. The production made its first overseas appearance at the Esplanade-Theaters on the Bay last night, captivating overseas media outlets and receiving exceptional reviews on the overseas social media platforms. Following the phenomenal success of its 2022 premiere in #China, “Wing Chun” has become a sought-after masterpiece. Presently, the production is running in Singapore through Saturday. #Chineseculture #martialarts #kungfu"
  },
  {
    "id": 1896829672043991153,
    "content": "#TwoSessions #China's top political advisory body, the Chinese People's Political Consultative Conference (#CPPCC) National Committee, opened its annual session on Tuesday in #Beijing. Chinese President Xi Jinping and other leaders attended the opening meeting of the third session of the 14th CPPCC National Committee, which commenced at 3 p.m. at the Great Hall of the People. At the meeting, the agenda for the session was reviewed and approved. Wang Huning, chairman of the CPPCC National Committee, delivered a work report on behalf of the Standing Committee of the CPPCC National Committee. (Source: Xinhua)"
  },
  {
    "id": 1620345761807634432,
    "content": "#Shenzhen has built a total of 11 #pet #themeparks across the city to allow pet owners to socialize their #dogs and get them some daily exercise. The city’s first pet theme park in Futian District opened to the public on Jan. 27, 2019."
  },
  {
    "id": 1866305092095521178,
    "content": "More than 10 speakers shared their insights and explorations at the #TEDxShenzhen2024 annual conference, held at Shenzhen International Garden and Flower Expo Park in Futian District on Sunday. With the theme of “Brave New World,” the speakers from diverse fields, including #technology, #arts, and #humanities, challenged conventional wisdom, engaged in candid dialogue, and shared ideas on pushing boundaries. Each speaker captivated hundreds of attendees, delivering impactful 18-minute talks on a range of topics. At the conference, Dr. Zhou Yaoqi, a physical biology scientist at Shenzhen Bay Lab in Guangming District, shared how he challenges his own limits in science exploration. #TED #shenzhen"
  },
  {
    "id": 1893942249870045470,
    "content": "Three undergraduates from Shenzhen University () received the #HongKongGoodCitizenAward (#GCA) 2024 for their courageous act of saving a life at an award presentation ceremony held yesterday in #HongKong. They are He Jinmiao, Wang Haolin, and Wen Jianbin, members of the class of 2021. He and Wen are from the College of Civil and Transportation Engineering, and Wang is from the College of Electronics and Information Engineering. In the early hours of Jan. 18, 2024, the three students, waiting for a bus in Hong Kong, rescued a woman who fell into the sea. He Jinmiao threw a lifebuoy and called police, while Wang and Wen sought help and reassured the woman. Hong Kong emergency services arrived quickly and rescued her. The students stayed to assist, and police credited their sense of responsibility for saving the woman's life. #GoodCitizen #EverydayHero #rescue #Shenzhen"
  },
  {
    "id": 1887029635994804284,
    "content": "Welcome to #Shenzhen! The Shenzhen Bao'an International Airport now has a dedicated International Service Center (Terminal 3, 1st floor, near international arrivals). Get sorted with payment solutions, tourism info, transport options (including the Shenzhentong \"Bay Area PASS Card\"), SIM cards, and immigration assistance - all in one place! Watch the video to find out more! #airport #service #ShenzhenAirport #travel #InternationalTravel #convenience"
  },
  {
    "id": 1779708140025708594,
    "content": "The four-day #InnoEX, a platform showcasing next-gen smart solutions, cutting-edge #tech, and disruptive #innovations, kicked off at the Hong Kong Convention and Exhibition Center on Saturday. Over 100 #Shenzhen enterprises exhibited their latest products and services, both in-person and online, to a global audience. The Shenzhen delegation highlighted \"Shenzhen tech creates a beautiful life\" by presenting innovative products across various tech fields. These include automated #coffeemachines with latte art capabilities, #drones for high-rise fire extinguishing, rapid-charging EV facilities, and a #robot companion for pets."
  },
  {
    "id": 1832280593771721150,
    "content": "An academic sharing session for the #Shenzhen #dancedrama “#WingChun” was held at the in #London, the U.K., on Friday morning local time, bringing together prominent figures from the arts world. The academic sharing session came at a time when “Wing Chun” would have its landmark 200th performance on the same day. The Shenzhen dance drama is being staged in London with 12 performances at the Sadler’s Wells Theatre from Aug. 30 to Saturday local time."
  },
  {
    "id": 1759126860611694597,
    "content": "The #GuangdongProvinceHighQualityDevelopmentConference was held in #Shenzhen today. \"China is an important part of ExxonMobil's business growth strategy and is also an important strategic market for #ExxonMobil's high-performance new lubricants and chemical products,\" said Jean-Marc Taton, chairman of China at the conference. With the strong support of the Guangdong Provincial Government and the strong and high-quality infrastructure and industrial ecosystem of Huizhou City, Exxon Mobil has successfully promoted the construction of the Huizhou Ethylene Phase I project in Daya Bay Petrochemical Zone and has achieved a safety man-hour milestone of over 40 million hours. Taton introduced that the project has invested more than 30 billion yuan, and will invest another 10 billion yuan this year to conduct equipment commissioning and trial operation, and prepare for commissioning and production at the end of the year. In addition, the project has also driven the implementation of multiple supporting projects with a total investment of 15 billion yuan. #GuangdongProvince #Guangdong #HighQualityDevelopment"
  },
  {
    "id": 1729689355135181115,
    "content": "A total of 4,684 wishes made by people from across the country are being displayed on one of the low earth orbit #satellites carried by the Long March 2D carrier #rocket that was launched at the Taiyuan Satellite Launch Center on Jan. 15. These wishes, accompanied by stunning photos of the #Earth and the #MilkyWay captured by an panoramic camera mounted on the satellite, were unveiled at a media briefing held at #Insta360’s office in #Qianhai yesterday afternoon."
  },
  {
    "id": 1873936201394401592,
    "content": "#Shenzhen officials have announced that #DJI, the world’s leading #drone maker, has been selected to build a global #headquarters for the intelligent aviation systems industry in the city. The plot of land for the project, located in the #ShenzhenBaySuperHeadquartersBase, covers about 15,658 square meters and will allow for a total construction area of approximately 188,000 square meters. The planned complex will include office space, retail, and cultural facilities. The tower will have a height limit of 300 meters, and the podium building will be capped at 60 meters."
  },
  {
    "id": 1925452044560998752,
    "content": "Coffee & Fortunes at #ICIF2025! Meet JoJo, the friendly #Turkish owner of a popular Sea World #cafe in Shekou, who's bringing a unique #tradition to the 21st China (Shenzhen) International Cultural Industries Fair (#ICIF) which opened today! JoJo's cafe is famous for its Turkish #coffee #fortunetelling, a fascinating tradition where fortunes are read from the leftover coffee grounds. Want to see how it's done? Watch this video to see JoJo make an authentic Turkish coffee right at ICIF! #ICIF #Türkiye #TurkishCoffee #Shenzhen #CulturalExchange"
  },
  {
    "id": 1846463211518021772,
    "content": "The #HKSARGovernment has proposed to the Central Government further enhancements on Mainland residents’ tourism visit endorsements to #HongKong, including resuming the “multiple‑entry” Individual Visit Endorsements for #Shenzhen residents and expanding the coverage of pilot cities for implementing policies on the “one trip per week” Individual Visit Endorsements, according to the Hong Kong Chief Executive's 2024 Policy Address released today. Additionally, to foster closer people ties with #ASEAN countries, starting today, the Government will relax the criteria for nationals of #Cambodia, #Laos and #Myanmar applying for multiple‑entry visas for travel and business, and extend the validity period of multiple‑entry visas for these countries from two years to three years. The arrangement also applies to #Vietnamese, who have benefitted from the relaxation of the visa policy since last year."
  },
  {
    "id": 1925736317914079277,
    "content": "#ICIF2025 The \"barometer of China's cultural industry development,\" ICIF 2025, is in full swing! The 21st China (Shenzhen) International Cultural Industries Fair opened its doors yesterday at the Shenzhen World Exhibition and Convention Center in Bao'an. Join us for a video tour of day one! Weekend plans include #ICIF? Don't miss this ultimate visitor's guide: #culture #CulturalEvent #Shenzhen #China #WeekendFun"
  },
  {
    "id": 1714187249523503262,
    "content": "For #Greek painter Barbara Gerodimou, as well as for billions of people around the world, building bridges and bringing people closer together through major #infrastructure projects that support common development and prosperity, through trade and cultural exchanges, is the only way forward to foster understanding and cooperation. #Greece’s largest port, #Piraeus, plays a key role in China’s #BeltandRoadInitiative (#BRI) thanks to its geostrategic position and has become a symbol of win-win cooperation."
  },
  {
    "id": 1892049460374667477,
    "content": "More than 200 local primary and secondary schools in Shenzhen have taken measures to make noon naps more comfortable for students, allowing them to lie down during lunch breaks. The initiative has benefited more than 300,000 local students to date. In China, it is common for students to take a nap at school after lunch. Most students nap at their desks, but experts have warned that the practice is bad for children’s physical development. #China #Shenzhen #students #nap #lunchbreak #school #study"
  },
  {
    "id": 1813760907127976189,
    "content": "Many high-tech products from #Shenzhen will make an appearance during the upcoming #Paris2024 #SummerOlympics and help with the smooth running of the opening ceremony and various events. As the Olympic flame arrived in #Paris on the evening of July 14, a dazzling drone and #fireworks show lit up the sky. A total of 1,100 drones formed shapes like an Olympic torchbearer and were accompanied by a stunning light and fireworks show, which added a high-tech romance to the city. These #drones were produced by Shenzhen HighGreat Innovation Technology Development Co. Ltd., a firm based in Longgang District. According to Li Chenliang, head of the company, the show featured drones carrying cold fireworks flying around the Eiffel Tower."
  },
  {
    "id": 1731939818026975354,
    "content": "On Dec. 3, 12-year-old twin brothers Li Bingchen and Li Bingheng from #Shenzhen delivered a speech at a side event themed \"Canal Cities: Eye of Climate Change Storm\" during the which is underway in #Dubai and runs through Dec. 12. They shared the results of a survey they conducted on #teenagers' awareness of #climatechange. They called for increased education and awareness for teenagers about climate change, and they pledged to start from themselves and actively influence people around them to participate in actions to address climate change. The brothers' speech was met with a standing ovation from the audience."
  },
  {
    "id": 1796353165568409972,
    "content": "#Shenzhen will promote the building of an international city of #wetlands and continuously develop the #InternationalMangroveCenter (IMC) with high standards, as announced by government officials at a news conference held by the city government Thursday. The news conference came hours after Shenzhen Executive Vice Mayor Tao Yongxin shared the city’s green and low-carbon development practices and achievements at the China High-Level Event on Subnational Climate Action held in California, the United States. #mangrove #China"
  },
  {
    "id": 1722432529469493631,
    "content": "The total #cargo throughput at #XiaomoPort exceeded 1 million tons in the first 10 months of the year, marking a remarkable growth of 136.65% year on year and setting a new record for the same period in the port’s history. The port’s car exports via roll-on/roll-on ships reached 15,000 units, accounting for about 30% of #Shenzhen’s total #vehicle #exports so far this year, data from the Shenzhen Municipal Transport Bureau showed."
  },
  {
    "id": 1899365932365172884,
    "content": "The 14th National People's Congress, China's national legislature, held the closing meeting of its third session on Tuesday. Chinese President Xi Jinping and other leaders attended the meeting at the Great Hall of the People in Beijing. (Source: Xinhua)"
  },
  {
    "id": 1910142096318853432,
    "content": "U.S. President #DonaldTrump on Wednesday paused #tariffs on most American trading partners for 90 days amid growing market turmoil, but sharply escalated tensions with #China by raising tariffs on #Chineseimports to 125%, according to China Daily. Earlier in the day, China announced it would raise tariffs on all U.S. #goods to 84% and added 18 U.S. companies to its export control and “unreliable entity” lists, in what analysts described as a broad response to U.S. trade pressure. Later Wednesday evening, China’s Ministry of Education issued a warning to students planning to study in the #UnitedStates, urging them to reassess plans in light of new legislation passed in #Ohio. Around the same time, the Ministry of Culture and Tourism issued a separate advisory, cautioning Chinese citizens to carefully evaluate safety risks before traveling to the United States. Both ministries cited deteriorating bilateral ties and rising anti-China sentiment."
  }
]